{
  "projects": [
    {
      "name": "brand studio",
      "title": "brand studio",
      "banner": {
        "backgroundImage": "./assets/images/projects/brand_studio/building.jpg",
        "bannerImage": "./assets/images/projects/brand_studio/banner_image.png",
        "heading": "uxynergy",
        "color": "#1E96FC"
      },
      "information": {
        "title": "project Information",
        "description": "Read about our brand studio project were we created our own brand that stands out of others and shows who we are.",
        "mockupImage": "./assets/images/projects/brand_studio/banner_second.png",
        "fullDescription": "Our team project is about creating a studio brand for our company, UXY (UXYnergy). We worked hard to develop a brand identity that truly represents who we are. We focused on the brand’s voice, logo, and visual style to create something unique and memorable. Our main goal was to build a brand that feels fun, stands out from the crowd, and shows the strong spirit of our team. In this project, we’ll take you through every step of the process. You’ll see everything from the initial sketches and wireframes to the stylescapes, version control, and detailed planning that went into the project."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "sketches",
            "description": "<span>Why:</span> I wanted to make sure our brand identity was clear so that our logo and visuals truly represent who we are and connect with our audience. <br></br> <span>What:</span> I started by organizing team discussions to decide on our brand’s voice and personality. We voted on our brand’s key characteristics, like our values and mission. I put everything we agreed on into a <a href='./assets/images/projects/brand_studio/documents/branding_document.pdf' target='_blank'>brand document<i class='fa-solid fa-arrow-right'></i></a>, so we could keep our ideas organized and make sure our design choices fit our brand’s message. <br></br> <span>How:</span> This document now guides our design for the logo, colors, and shapes, so each part matches our brand identity. Through this, I learned how to bring together everyone’s ideas into one clear plan. I also learned how to think about design from the audience’s point of view, making sure each visual choice communicates our brand clearly.",
            "images": [
              "./assets/images/projects/brand_studio/sketches_logo.png"
            ]
          },
          {
            "id": "2",
            "title": "stylescape",
            "description": "<span>Why:</span> I wanted to make a <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>stylescape<i class='fa-solid fa-arrow-right'></i></a> to get a strong visual feel for the brand. This would help keep our designs true to our brand’s personality and make sure they appeal to our audience. <br></br> <span>What:</span> I looked for images and design elements that showed our brand’s main values (fun, eye-catching, and dynamic). Finding the right visuals was hard, and it took time to pick images that really matched our brand. I focused on pictures that fit our brand’s core look and would help us keep a consistent design style. <br></br> <span>How:</span> In the end, the stylescape helped bring our brand vision to life. It made it easier to design visuals that match our brand identity. This process taught me how to turn brand ideas into real visuals, which will help in future design work. It also helped me improve my skills in creating a consistent look and feel for the brand, which is important in media design.",
            "images": [
              "./assets/images/projects/brand_studio/stylescape.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "github",
            "description": "<span>Why:</span> I wanted to improve team communication and workflow, so everyone could easily access and update our project files. <br></br> <span>What:</span> set up a <a href='https://github.com/Dracopol/uxy/tree/main' target='_blank'>GitHub<i class='fa-solid fa-arrow-right'></i></a> repository with a simple structure that everyone could follow. This made it easy to organize and share our work in one place. The setup process was simple and didn’t take much time. <br></br> <span>How:</span> In the end, the GitHub repository helped our team work together more smoothly. It kept our files organized and made it easy to track changes. This experience taught me that it can be really handy, since i had a merge conflict and I needed to go back to the old version.",
            "images": [
              "./assets/images/projects/brand_studio/uxy_github.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "business cards",
            "description": "<span>Why:</span> I wanted to create business cards that clearly show our brand’s identity using our brand’s color palette. <br></br> <span>What:</span> I designed three <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>business cards<i class='fa-solid fa-arrow-right'></i></a>, making sure to use our brand’s colors. After getting feedback from our teacher, I changed the logo to show unity and teamwork by making the puzzle pieces fit together. The teacher also suggested using bright colors, so I added them to make the design fun and eye-catching. I also looked for design ideas on Awwwards and Pinterest. <br></br> <span>How:</span> Designing these business cards helped me think creatively and mix both feedback and my own ideas. I had to find a way to make the logo represent unity and teamwork through the puzzle design. The bright colors made it hard to keep the design professional but still fun. The feedback helped me improve my work, and I learned how to apply feedback to improve my designs and make them more polished and professional, which is important for working in a real-world project.",
            "images": [
              "./assets/images/projects/brand_studio/bs1.png",
              "./assets/images/projects/brand_studio/bs2.png",
              "./assets/images/projects/brand_studio/bs3.png",
              "./assets/images/projects/brand_studio/bsfeedback.png",
              "./assets/images/projects/brand_studio/bs4.png"
            ]
          },
          {
            "id": "2",
            "title": "wireframes",
            "description": "<span>Why:</span> I wanted to create clear <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> for the website to plan how it would look and work, making sure it was easy to use and matched our brand. <br></br> <span>What:</span> I started by making a simple wireframe in Figma to plan the website layout. When I worked on the more detailed wireframe, I asked for feedback from the team. They said I should add more images, use more colors, and think about how to show the puzzle pieces in the design. I also made the header navigation easier to read and changed the colors to match the new branding. <br></br> <span>How:</span> The design process went well, but we had some problems with how to show the puzzle pieces and organize the website. We solved these problems together, and I learned how to improve my designs based on feedback. I also learned how to adjust my work when things change. Next time, I would spend more time improving the design and better manage my time. I then turned the wireframes into a real website, using what I learned.",
            "images": [
              "./assets/images/projects/brand_studio/wireframe.png",
              "./assets/images/projects/brand_studio/wireframe_feedback1.png",
              "./assets/images/projects/brand_studio/wireframe_feedback2.png",
              "./assets/images/projects/brand_studio/Homepages.png"
            ]
          },
          {
            "id": "3",
            "title": "website",
            "description": "<span>Why:</span> I wanted to turn the wireframe designs into a working website that looked like the design, was easy to use, and worked well on all devices. <br></br> <span>What:</span> I followed the <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> carefully to build the <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a>, making sure it looked like the design. I also made sure the website worked well on mobile devices, adjusting the layout for smaller screens. There were no big problems with talking to my colleague, and time management was not an issue. I also made sure the code was easy to read by organizing the files well, using the right names, and adding comments to explain things. <br></br> <span>How:</span> Building the website went well, and I was able to make it work as planned. I learned how important it is to keep the code clean and easy to understand. This helped me improve my coding skills and feel more confident in making websites that work well, look good, and are easy to maintain.",
            "images": [
              "./assets/images/projects/brand_studio/website.png",
              "./assets/images/projects/brand_studio/code.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "process",
            "description": "<span>Why:</span> At the start of the project, we needed to stay organized and keep everyone updated. I set up <a href='https://trello.com/b/Mk6JKvMD/to-do' target='_blank'>trello<i class='fa-solid fa-arrow-right'></i></a> with our group to track our goals, so we could easily share our progress with the stakeholders. <br></br> <span>What:</span> During the project, one of my teammates needed help with using GitHub and branches. I taught him how to use it, so he could work better. I also made sure to update the team on my progress, so they knew where we were in the project. <br></br> <span>How:</span> I used Trello to track and share our progress with the team and stakeholders. I helped my teammate with GitHub, making sure he understood how to use it. I also focused on making the website accessible for both mobile and desktop users, so it met the current web standards and trends. This helped the team stay on track and ensured we were working professionally.",
            "images": [
              "./assets/images/projects/brand_studio/trello.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "personal leadership",
            "description": "<span>Why:</span> At the beginning of the project, we talked about what we are good at and where we need to improve. I knew I could help with development because I have some experience. I also realized that planning is a weakness for me, so I wanted to work on that while helping the team. <br></br> <span>What:</span> I decided to help with development since I felt confident. To improve my planning skills, I helped set up Trello and made sure everything was moving along. Giving feedback to the team helped me understand how I can improve my communication and decision-making. <br></br> <span>How:</span> I used my skills in development to help the team. I worked on my planning by setting up Trello and keeping everything organized. I also learned that better communication would help the team make decisions faster. Next time, I want to focus on talking directly with the team so we can work more efficiently and make better decisions. This project helped me see my strengths and weaknesses, which will help me grow as a frontend developer.",
            "images": []
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "website",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          },
          {
            "text": "github",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/Dracopol/uxy/tree/main"
          },
          {
            "text": "trello",
            "icon": "fa-brands fa-trello",
            "link": "https://trello.com/b/Mk6JKvMD/to-do"
          },
          {
            "text": "brandguide",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/brand_studio/documents/branding_document.pdf"
          },
          {
            "text": "brandguide",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          }
        ]
      }
    },
    {
      "name": "portfolio",
      "title": "portfolio",
      "banner": {
        "backgroundImage": "./assets/images/projects/portfolio/nature.avif",
        "bannerImage": "./assets/images/projects/portfolio/mockup.png",
        "heading": "portfolio",
        "color": "#282828"
      },
      "information": {
        "title": "project Information",
        "description": "Read about my portfolio project were I created a website to display my work and my passion.",
        "mockupImage": "./assets/images/projects/portfolio/banner.png",
        "fullDescription": "Our teamproject is about creating a studio brand that represents our company called UXY (UXYnergy). We put a lot of thought into our brand’s voice, logo, and look to create something unique. Our goal was to make a brand identity that feels fun, stands out, and shows our team spirit."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "sketches",
            "description": "First we talked and voted about our brand voice and characteristics to determine who we are as a brand studio. We have written this down in the brand <a href='./assets/images/projects/brand_studio/documents/branding_document.pdf' target='_blank'>document<i class='fa-solid fa-arrow-right'></i></a>, since that will be shown within the logo with colors, shapes, etc. <br></br> For the logo design, we came up with the name (UXYnergy). I started the design by making some rough sketches on paper, focusing on how to create a good user experience and appealing visuals that represent the brand well with the core characteristics fun, eye-catching, & dynamic. That’s why I’ve chosen these shapes with a flow.",
            "images": [
              "./assets/images/projects/brand_studio/sketches_logo.png"
            ]
          },
          {
            "id": "2",
            "title": "stylescape",
            "description": "I’ve created a stylescape to get a feeling of the brand. It was difficult to find the right images to represent our brand, but in the end it worked very well.",
            "images": [
              "./assets/images/projects/brand_studio/stylescape.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "github",
            "description": "For better communication and workflow, I set up a <a href='https://github.com/Dracopol/uxy' target='_blank'>github<i class='fa-solid fa-arrow-right'></i></a> repository with a simple structure. This was very easy because it wasn’t difficult to setup.",
            "images": [
              "./assets/images/projects/brand_studio/uxy_github.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "business cards",
            "description": "I created three <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=0-1&t=26fK9ZyDULif6hdn-1' target='_blank'>business cards<i class='fa-solid fa-arrow-right'></i></a> and designed them using our brand's color palette. <br></br> Based on our teacher's feedback, I created a new logo design where the puzzle pieces fit together. This shows the idea of unity and teamwork. The teacher also liked bright colors, so I added vibrant colors to make the design more fun and appealing. The process of making these business cards went very well, I also got some good feedback from the teachers and I looked up some nice designs on <a href='https: //www.awwwards.com/' target='_blank'>awwwards.com<i class='fa-solid fa-arrow-right'></i></a> and <a href='https://nl.pinterest.com/homefeed/' target='_blank'>Pinterest<i class='fa-solid fa-arrow-right'></i></a>.",
            "images": [
              "./assets/images/projects/brand_studio/bs1.png",
              "./assets/images/projects/brand_studio/bs2.png",
              "./assets/images/projects/brand_studio/bs3.png",
              "./assets/images/projects/brand_studio/bsfeedback.png",
              "./assets/images/projects/brand_studio/bs4.png"
            ]
          },
          {
            "id": "2",
            "title": "wireframes",
            "description": "I started with a low-fidelity <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=0-1&t=26fK9ZyDULif6hdn-1' target='_blank'>wireframe<i class='fa-solid fa-arrow-right'></i></a> for the website in figma. While creating the high-fidelity wireframe, we asked for feedback. The main points were to use more imagery, colors and the way of using the puzzle pieces in the design. I also improved the readability of the header navigation and updated the colors to match recent changes made by our branding team. <br></br> The design phase went well, but we faced some challenges. We had to figure out how to show the puzzle pieces and the structure of the website. In the end, we worked through these issues successfully, but for next time I would focus more on iterating, and look at the time management. <br></br> I developed these designs into a <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=0-1&t=26fK9ZyDULif6hdn-1' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a>.",
            "images": [
              "./assets/images/projects/brand_studio/wireframe.png",
              "./assets/images/projects/brand_studio/wireframe_feedback1.png",
              "./assets/images/projects/brand_studio/wireframe_feedback2.png",
              "./assets/images/projects/brand_studio/Homepages.png"
            ]
          },
          {
            "id": "3",
            "title": "website",
            "description": "I developed these designs into a <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=0-1&t=26fK9ZyDULif6hdn-1' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a>. I tried to create these as similar to the design. It went very well and didn’t walk into any issues with the communication with my colleague and time management wasn’t much of an issue here. Also I made everything in the code a bit readable by having a well structured file with the right name spacing and comments.",
            "images": [
              "./assets/images/projects/brand_studio/website.png",
              "./assets/images/projects/brand_studio/code.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "Process",
            "description": "At the start of the project, I helped set up <a href='https://trello.com/b/Mk6JKvMD/to-do' target='_blank'>trello<i class='fa-solid fa-arrow-right'></i></a> to track our goals. This way, we can keep stakeholders updated on our progress. <br></br> During the development phase, I noticed that one colleague needed help with branches and GitHub. I gave him a short lesson and assisted him throughout the process. <br></br> For communication, I regularly shared my progress with my team to keep them updated on how far I was in the project phase. <br></br> The accessibility is also a crucial part, to have our users be able to visit the website on mobile and desktop, since I’m trying to achieve the standard for websites and to keep up with website trend.",
            "images": [
              "./assets/images/projects/brand_studio/trello.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "Personal leadership",
            "description": "At the beginning of the project, we discussed our strengths and weaknesses. I saw an opportunity to help the team with development since I have some background in it. So, I volunteered to assist during the development phase of the project. I recognized that planning is one of my weaknesses, so I helped set up Trello and made sure everything was on track. The planning and giving people feedback will definitely be there when I’m working as a frontend developer in a company, so these insights could really help me seeing my own qualities. The project went well, but next time, I want to focus on having more direct communication within the team. This will help us make decisions faster and improve our time management.",
            "images": []
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "website",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          },
          {
            "text": "github",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/Dracopol/uxy/tree/main"
          },
          {
            "text": "trello",
            "icon": "fa-brands fa-trello",
            "link": "https://trello.com/b/Mk6JKvMD/to-do"
          },
          {
            "text": "brandguide",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/brand_studio/documents/branding_document.pdf"
          },
          {
            "text": "brandguide",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          }
        ]
      }
    }
  ]
}