{
  "projects": [
    {
      "name": "passionate project",
      "title": "passion work",
      "banner": {
        "backgroundImage": "./assets/images/projects/passionate/passionate_banner2.png",
        "bannerImage": "./assets/images/projects/passionate/passionate_banner1.png",
        "heading": "passionate project",
        "color": "#649F64"
      },
      "information": {
        "title": "project Information",
        "description": "Read about my passion project I have done to learn more about app/web design and to use it the next stage of my development process",
        "mockupImage": "./assets/images/projects/passionate/passionate_banner2.png",
        "fullDescription": "The project is about a digital agenda for a pedicure practice, created for a client who owns the practice. The problems they faced included rare double bookings and frequently forgetting client appointments. They also wanted better oversight and management of their client base. I have come up with solutions and developed the entire process in Figma/demo design."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "interview pedicure",
            "description": "<span>Why:</span> In the <a href='./assets/images/projects/passionate/documents/stakeholder_brief.pdf' target='_blank'>interview<i class='fa-solid fa-arrow-right'></i></a>, my client, who runs a pedicure business, told me that she has trouble managing her schedule. She forgets appointments sometimes and is worried about double bookings. She needs an easy way to stay organized and in control of her client appointments. My goal is to create an app that helps her with these problems and makes managing her business easier. <br></br>  <span>What:</span> From the interview, I learned that the app should show her availability and booked appointments clearly. The app needs to have reminders for her appointments, stop double bookings, and be easy to use for managing appointments. She also wants a simple login for security. The app will mainly be used on desktop, but it can be checked on mobile sometimes. <br></br> <span>How:</span> The information from the interview helps me know what to focus on in the design. I will create a simple and easy-to-use interface with a clear calendar and list of appointments. The app will send reminders to make sure the client doesn’t forget appointments. The login will be easy to use, and the design will be made for desktop use so she can manage her schedule easily.",
            "images": [
              "./assets/images/projects/passionate/interview.png"
            ]
          },
          {
            "id": "2",
            "title": "moodboard",
            "description": "<span>Why:</span> Based on my client’s request, I wanted to gather some visual inspiration to guide the design process for the scheduling app. I needed a <a href='https://www.figma.com/design/ZUOjcSHQXbiADrgqXCDR20/passion-project?node-id=0-1&t=BRI3eR6puKbNNUwi-1' target='_blank'>moodboard<i class='fa-solid fa-arrow-right'></i></a> to reflect the simple, clean, and easy-to-use style the client wanted, helping me set the overall direction for the app’s look and feel. <br></br> <span>What:</span> I looked for inspiration online, focusing on simple scheduling apps and clean, minimalistic designs. I gathered images that featured clear calendars, user-friendly interfaces, and other elements that could inform the app's design. The goal was to capture a style that matched the client’s needs and suited the pedicure practice. <br></br> <span>How:</span> The moodboard helped me organize visual ideas and define the style for the app. It gave me a clear direction for the design and kept me focused on creating a clean, professional, and easy-to-use app that aligned with the client’s vision.",
            "images": [
              "./assets/images/projects/passionate/moodboard.png"
            ]
          },
          {
            "id": "3",
            "title": "low fidelity wireframes",
            "description": "<span>Why:</span> I created low-fidelity <a href='https://www.figma.com/design/ZUOjcSHQXbiADrgqXCDR20/passion-project?node-id=0-1&t=BRI3eR6puKbNNUwi-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> to map out the app’s layout and core features. This step helped me visualize the structure and flow of the app, ensuring it aligned with the client’s needs and the concept I developed. I also referred to literature and design guidelines to ensure the wireframes were based on best practices. <br></br> <span>What:</span> The wireframes were simple, focusing on key components like the calendar view, appointment slots, and login screen. I used basic shapes to represent the content and layout, aiming for a clear, intuitive design. <br></br> <span>How:</span> The wireframes helped me refine the app’s structure, allowing me to organize content in a user-friendly way. This step was essential in visualizing the app’s functionality before moving on to more detailed design work, based on my research.",
            "images": [
              "./assets/images/projects/passionate/wireframe_low1.png",
              "./assets/images/projects/passionate/wireframe_low2.png",
              "./assets/images/projects/passionate/wireframe_low3.png"
            ]
          },
          {
            "id": "4",
            "title": "high fidelity wireframes",
            "description": "<span>Why:</span> After creating the low-fidelity wireframes, I made high-fidelity <a href='https://www.figma.com/design/ZUOjcSHQXbiADrgqXCDR20/passion-project?node-id=0-1&t=BRI3eR6puKbNNUwi-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> to show my client exactly how the desktop app would work. This helped me make the design clearer and more realistic for the client. <br></br> <span>What:</span> The high-fidelity wireframes looked more like the final app, with real content and design details like buttons and the calendar layout. This helped the client see how everything would be arranged and work together. <br></br> <span>How:</span> Making high-fidelity wireframes helped me give the client a clear picture of how the app would look and work. This made it easier for the client to understand the design and helped me with making the final steps, such as a demo.",
            "images": [
              "./assets/images/projects/passionate/wireframe_high1.png",
              "./assets/images/projects/passionate/wireframe_high2.png",
              "./assets/images/projects/passionate/wireframe_high3.png",
              "./assets/images/projects/passionate/wireframe_high4.png",
              "./assets/images/projects/passionate/wireframe_high5.png",
              "./assets/images/projects/passionate/wireframe_high6.png",
              "./assets/images/projects/passionate/wireframe_high7.png",
              "./assets/images/projects/passionate/wireframe_high8.png"
            ]
          }
        ],
        "2": [],
        "3": [
          {
            "id": "1",
            "title": "labels & colors",
            "description": "<span>Why:</span> Based on the feedback I received from my client, I realized that using colors could make it easier for my client to manage appointments and label them clearly. The idea was to create a simple way for the user to select a color for each appointment. <br></br> <span>What:</span> I created two different color selection designs to see which one worked best. After testing, I decided to go with the rectangular option. Then, I showed it to a fellow student, who suggested adding an option for users to choose colors from the entire color wheel. I thought this was a great idea, so I added it to the design. <br></br> <span>How:</span> By creating different iterations of the color selection feature, I was able to improve the design. The feedback from my classmate helped me make the tool more flexible, allowing users to choose any color they want. This helped me refine the design and ensure it met the client’s needs.",
            "images": [
              "./assets/images/projects/passionate/iteration1.png",
              "./assets/images/projects/passionate/iteration2.png",
              "./assets/images/projects/passionate/iteration3.png",
              "./assets/images/projects/passionate/iteration4.png"
            ]
          },
          {
            "id": "2",
            "title": "personal descriptions",
            "description": "<span>Why:</span> After receiving feedback from my client, I learned that she also has medical clients and needs to keep track of specific information about them, such as whether they are a medical patient. This would help her manage different types of clients more easily. <br></br> <span>What:</span> I added a feature that allows my client to write a small description for each client. This description can include important details, like if the client is a medical patient. Additionally, I made sure that the description is shown as a tooltip when hovering over a client's name in the schedule or client tab. <br></br> <span>How:</span> By incorporating this feature, I improved the app's usability, making it easier for my client to manage medical and non-medical clients. The tooltip helps her quickly access the information she needs, without cluttering the interface. This change improved the overall design based on the feedback I received.",
            "images": [
              "./assets/images/projects/passionate/iteration5.png",
              "./assets/images/projects/passionate/iteration6.png",
              "./assets/images/projects/passionate/iteration7.png",
              "./assets/images/projects/passionate/iteration8.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "research",
            "description": "<span>Why:</span> From my <a href='./assets/images/projects/passionate/documents/research.pdf' target='_blank'>research<i class='fa-solid fa-arrow-right'></i></a>, I found features that could help solve common problems pedicure service providers face, like double-booking and missed appointments. Features like automatic reminders, self-booking, and showing real-time availability could be useful for the app. <br></br> <span>What:</span> I found that pedicure providers have trouble managing appointments manually. To help with this, I included features like automatic reminders, real-time availability, and adjusting appointment times. I also learned that the app should be simple and easy for everyone to use, even if they’re not good with technology. <br></br> <span>How:</span> Using what I learned, I added these helpful features to the app, like reminders and real-time availability, to reduce mistakes and save time. I also made the design simple and easy to use so anyone, even without tech skills, could use it.",
            "images": [
              "./assets/images/projects/passionate/research.png"
            ]
          },
          {
            "id": "2",
            "title": "feedback",
            "description": "<span>Why:</span> I shared the high-fidelity wireframes with my client to make sure the design was clear and met her needs. She gave me helpful <a href='./assets/images/projects/passionate/documents/stakeholder_brief.pdf' target='_blank'>feedback<i class='fa-solid fa-arrow-right'></i></a>, which helped me improve the app further. I wanted the design to not only look good but also solve her specific challenges. <br></br> <span>What:</span> One suggestion was to use colors to easily show different types of appointments, like couples or medical clients. She also mentioned the importance of adding a short description for each client so she can quickly see important details, especially for medical clients who may need home visits. She liked that the design was simple to use and visually appealing. <br></br> <span>How:</span> Based on her feedback, I improved the wireframes by adding a feature to assign colors to appointments and a way to include client descriptions. These changes made the app more user-friendly and practical for her daily tasks. Reflecting on this, I learned how important it is to listen to feedback and adapt designs to fit the user’s needs better. This experience also helped me understand how small adjustments can make a big difference in usability.",
            "images": [
              "./assets/images/projects/passionate/feedback.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "specialization",
            "description": "<span>Why:</span> I chose this project because it’s related to designing applications and dashboards, which is something I’ll focus on in my specialization next semester. By working on this, I’m getting myself ready for that. It’s important to learn these skills now, so I can be better prepared for the more advanced work I’ll be doing later. <br></br> <span>What:</span> This project involves creating a simple scheduling app, and through this, I’m learning how to design functional, user-friendly interfaces that can be applied to many different types of applications. <br></br> <span>How:</span> Working on this project is helping me develop the skills I need for my specialization. I’m learning how to make apps that not only look good but also work well for the users. This experience will definitely help me in the future when I focus on more advanced design projects.",
            "images": [
              "./assets/images/projects/passionate/wireframe_high1.png"
            ]
          },
          {
            "id": "2",
            "title": "user focused direction",
            "description": "<span>Why:</span> I chose this project to improve my skills in designing apps that are easy to use and solve real problems. The project helped me focus on creating something that would be useful and simple for my client. I wanted to make sure the app would help her manage her appointments better while also helping me get better at designing with the user in mind. <br></br> <span>What:</span> In this project, I created a scheduling app that focuses on what my client needs. I looked at her problems, like forgetting appointments and double booking, and made sure the app could help with that. I also added features based on her feedback, like allowing her to write a description for each client and clearer reminders. <br></br> <span>How:</span> By focusing on my client’s needs, I made sure the app was simple and easy to use. I used the feedback I got to make the app better and easier for anyone to understand, even if they’re not good with technology. This project helped me improve my skills in designing apps that are useful and easy for people to use.",
            "images": [
              "./assets/images/projects/passionate/wireframe_high1.png"
            ]
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "stakeholder brief",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/passionate/documents/stakeholder_brief.pdf"
          },
          {
            "text": "interview & feedback",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/passionate/documents/interview_transcript.pdf"
          },
          {
            "text": "moodboard",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/ZUOjcSHQXbiADrgqXCDR20/passion-project?node-id=0-1&t=BRI3eR6puKbNNUwi-1"
          },
          {
            "text": "wireframes",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/ZUOjcSHQXbiADrgqXCDR20/passion-project?node-id=0-1&t=BRI3eR6puKbNNUwi-1"
          },
          {
            "text": "research",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/passionate/documents/research.pdf"
          }
        ]
      }
    },
    {
      "name": "brand studio",
      "title": "brand studio",
      "banner": {
        "backgroundImage": "./assets/images/projects/brand_studio/banner_background.png",
        "bannerImage": "./assets/images/projects/brand_studio/banner_image.png",
        "heading": "uxynergy",
        "color": "#1E96FC"
      },
      "information": {
        "title": "project Information",
        "description": "Read about our brand studio project were we created our own brand that stands out of others and shows who we are.",
        "mockupImage": "./assets/images/projects/brand_studio/banner.png",
        "fullDescription": "Our team project is about creating a studio brand for our company, UXY (UXYnergy). We worked hard to develop a brand identity that truly represents who we are. We focused on the brand’s voice, logo, and visual style to create something unique and memorable. Our main goal was to build a brand that feels fun, stands out from the crowd, and shows the strong spirit of our team. In this project, we’ll take you through every step of the process. You’ll see everything from the initial sketches and wireframes to the stylescapes, version control, and detailed planning that went into the project."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "sketches",
            "description": "<span>Why:</span> I wanted to make sure our brand identity was clear so that our logo and visuals truly represent who we are and connect with our audience. <br></br> <span>What:</span> I started by organizing team discussions to decide on our brand’s voice and personality. We voted on our brand’s key characteristics, like our values and mission. I put everything we agreed on into a <a href='./assets/images/projects/brand_studio/documents/branding_document.pdf' target='_blank'>brand document<i class='fa-solid fa-arrow-right'></i></a>, so we could keep our ideas organized and make sure our design choices fit our brand’s message. <br></br> <span>How:</span> This document now guides our design for the logo, colors, and shapes, so each part matches our brand identity. Through this, I learned how to bring together everyone’s ideas into one clear plan. I also learned how to think about design from the audience’s point of view, making sure each visual choice communicates our brand clearly.",
            "images": [
              "./assets/images/projects/brand_studio/sketches_logo.png"
            ]
          },
          {
            "id": "2",
            "title": "stylescape",
            "description": "<span>Why:</span> I wanted to make a <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>stylescape<i class='fa-solid fa-arrow-right'></i></a> to get a strong visual feel for the brand. This would help keep our designs true to our brand’s personality and make sure they appeal to our audience. <br></br> <span>What:</span> I looked for images and design elements that showed our brand’s main values (fun, eye-catching, and dynamic). Finding the right visuals was hard, and it took time to pick images that really matched our brand. I focused on pictures that fit our brand’s core look and would help us keep a consistent design style. <br></br> <span>How:</span> In the end, the stylescape helped bring our brand vision to life. It made it easier to design visuals that match our brand identity. This process taught me how to turn brand ideas into real visuals, which will help in future design work. It also helped me improve my skills in creating a consistent look and feel for the brand, which is important in media design.",
            "images": [
              "./assets/images/projects/brand_studio/stylescape.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "github",
            "description": "<span>Why:</span> I wanted to improve team communication and workflow, so everyone could easily access and update our project files. <br></br> <span>What:</span> set up a <a href='https://github.com/Dracopol/uxy/tree/main' target='_blank'>GitHub<i class='fa-solid fa-arrow-right'></i></a> repository with a simple structure that everyone could follow. This made it easy to organize and share our work in one place. The setup process was simple and didn’t take much time. <br></br> <span>How:</span> In the end, the GitHub repository helped our team work together more smoothly. It kept our files organized and made it easy to track changes. This experience taught me that it can be really handy, since i had a merge conflict and I needed to go back to the old version.",
            "images": [
              "./assets/images/projects/brand_studio/uxy_github.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "business cards",
            "description": "<span>Why:</span> I wanted to create business cards that clearly show our brand’s identity using our brand’s color palette. <br></br> <span>What:</span> I designed three <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>business cards<i class='fa-solid fa-arrow-right'></i></a>, making sure to use our brand’s colors. After getting feedback from our teacher, I changed the logo to show unity and teamwork by making the puzzle pieces fit together. The teacher also suggested using bright colors, so I added them to make the design fun and eye-catching. I also looked for design ideas on Awwwards and Pinterest. <br></br> <span>How:</span> Designing these business cards helped me think creatively and mix both feedback and my own ideas. I had to find a way to make the logo represent unity and teamwork through the puzzle design. The bright colors made it hard to keep the design professional but still fun. The feedback helped me improve my work, and I learned how to apply feedback to improve my designs and make them more polished and professional, which is important for working in a real-world project.",
            "images": [
              "./assets/images/projects/brand_studio/bs1.png",
              "./assets/images/projects/brand_studio/bs2.png",
              "./assets/images/projects/brand_studio/bs3.png",
              "./assets/images/projects/brand_studio/bsfeedback.png",
              "./assets/images/projects/brand_studio/bs4.png"
            ]
          },
          {
            "id": "2",
            "title": "wireframes",
            "description": "<span>Why:</span> I wanted to create clear <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> for the website to plan how it would look and work, making sure it was easy to use and matched our brand. <br></br> <span>What:</span> I started by making a simple wireframe in Figma to plan the website layout. When I worked on the more detailed wireframe, I asked for feedback from the team. They said I should add more images, use more colors, and think about how to show the puzzle pieces in the design. I also made the header navigation easier to read and changed the colors to match the new branding. <br></br> <span>How:</span> The design process went well, but we had some problems with how to show the puzzle pieces and organize the website. We solved these problems together, and I learned how to improve my designs based on feedback. I also learned how to adjust my work when things change. Next time, I would spend more time improving the design and better manage my time. I then turned the wireframes into a real website, using what I learned.",
            "images": [
              "./assets/images/projects/brand_studio/wireframe.png",
              "./assets/images/projects/brand_studio/wireframe_feedback1.png",
              "./assets/images/projects/brand_studio/wireframe_feedback2.png",
              "./assets/images/projects/brand_studio/Homepages.png"
            ]
          },
          {
            "id": "3",
            "title": "website",
            "description": "<span>Why:</span> I wanted to turn the wireframe designs into a working website that looked like the design, was easy to use, and worked well on all devices. <br></br> <span>What:</span> I followed the <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> carefully to build the <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a>, making sure it looked like the design. I also made sure the website worked well on mobile devices, adjusting the layout for smaller screens. There were no big problems with talking to my colleague, and time management was not an issue. I also made sure the code was easy to read by organizing the files well, using the right names, and adding comments to explain things. <br></br> <span>How:</span> Building the website went well, and I was able to make it work as planned. I learned how important it is to keep the code clean and easy to understand. This helped me improve my coding skills and feel more confident in making websites that work well, look good, and are easy to maintain.",
            "images": [
              "./assets/images/projects/brand_studio/website.png",
              "./assets/images/projects/brand_studio/code.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "process",
            "description": "<span>Why:</span> At the start of the project, we needed to stay organized and keep everyone updated. I set up <a href='https://trello.com/b/Mk6JKvMD/to-do' target='_blank'>trello<i class='fa-solid fa-arrow-right'></i></a> with our group to track our goals, so we could easily share our progress with the stakeholders. <br></br> <span>What:</span> During the project, one of my teammates needed help with using GitHub and branches. I taught him how to use it, so he could work better. I also made sure to update the team on my progress, so they knew where we were in the project. <br></br> <span>How:</span> I used Trello to track and share our progress with the team and stakeholders. I helped my teammate with GitHub, making sure he understood how to use it. I also focused on making the website accessible for both mobile and desktop users, so it met the current web standards and trends. This helped the team stay on track and ensured we were working professionally.",
            "images": [
              "./assets/images/projects/brand_studio/trello.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "personal leadership",
            "description": "<span>Why:</span> At the beginning of the project, we talked about what we are good at and where we need to improve. I knew I could help with development because I have some experience. I also realized that planning is a weakness for me, so I wanted to work on that while helping the team. <br></br> <span>What:</span> I decided to help with development since I felt confident. To improve my planning skills, I helped set up Trello and made sure everything was moving along. Giving feedback to the team helped me understand how I can improve my communication and decision-making. <br></br> <span>How:</span> I used my skills in development to help the team. I worked on my planning by setting up Trello and keeping everything organized. I also learned that better communication would help the team make decisions faster. Next time, I want to focus on talking directly with the team so we can work more efficiently and make better decisions. This project helped me see my strengths and weaknesses, which will help me grow as a frontend developer.",
            "images": []
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "website",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          },
          {
            "text": "github",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/Dracopol/uxy/tree/main"
          },
          {
            "text": "trello",
            "icon": "fa-brands fa-trello",
            "link": "https://trello.com/b/Mk6JKvMD/to-do"
          },
          {
            "text": "brandguide",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/brand_studio/documents/branding_document.pdf"
          },
          {
            "text": "brandguide",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          }
        ]
      }
    },
    {
      "name": "portfolio",
      "title": "portfolio",
      "banner": {
        "backgroundImage": "./assets/images/projects/portfolio/rock_background.avif",
        "bannerImage": "./assets/images/projects/portfolio/banner_image.png",
        "heading": "portfolio",
        "color": "#171717"
      },
      "information": {
        "title": "project Information",
        "description": "Read about my portfolio project were I created a website to display my work and my passion.",
        "mockupImage": "./assets/images/projects/portfolio/banner.png",
        "fullDescription": "In my portfolio, I show the process I went through for each project and why I made certain choices. I wanted every decision to be clear and have a purpose, helping the viewer understand my skills and style. I kept the layout simple so that each project is easy to explore. I chose colors, fonts, and design elements that match each project’s theme to make them stand out. I also listened to feedback, which helped me see areas for improvement and made my portfolio look more professional and engaging."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "moodboard",
            "description": "<span>Why:</span> I made a <a href='https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1' target='_blank'>moodboard<i class='fa-solid fa-arrow-right'></i></a> because I wanted to explore different design ideas and find out what really speaks to me. I needed a way to see a variety of styles and ideas all in one place, so I could pick the elements that match my vision. Creating this moodboard helped give me direction and made me think more about what makes a design interesting and effective. <br></br> <span>What:</span> For my inspiration, I used the website awwwards.com. This site has some of the best website designs, so it was perfect for finding quality examples. I looked for sites with unique styles, strong visuals, and clear layouts. Then, I collected a mix of design styles, colors, layouts, and interactions to see what stood out to me. <br></br> <span>How:</span> Putting these inspirations together in a moodboard helped me clearly see which design principles I like most. It gave me a chance to look at different visual styles and decide what might work for my project. By making this moodboard it helps me with the basics of designing, for example understanding in a design why a element is placed on that particular position with that styling.",
            "images": [
              "./assets/images/projects/portfolio/moodboard.png"
            ]
          },
          {
            "id": "2",
            "title": "testing flow/design",
            "description": "<span>Why:</span> I did flow and design testing <a href='./assets/images/projects/portfolio/documents/testing_document.pdf' target='_blank'>document<i class='fa-solid fa-arrow-right'></i></a> on my portfolio wireframe with 5 people to make sure users could easily find my projects and contact me. I wanted to understand how they felt about the design and structure. <br></br> <span>What:</span> I gave them 5 tasks to complete, and based on their feedback, I learned that the menu icon wasn’t clear to users and they wanted a quicker way to navigate to the projects. <br></br> <span>How:</span> The testing went well good, since everyone finished their tasks quickly. I got useful feedback that I can improve on, and I’ll definitely do this again in the future because it helped me make the design better.",
            "images": [
              "./assets/images/projects/portfolio/testing.png"
            ]
          },
          {
            "id": "3",
            "title": "interactive prototyping",
            "description": "<span>Why:</span> I created an interactive <a href='https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1' target='_blank'>prototype<i class='fa-solid fa-arrow-right'></i></a> using Figma to see how the final product would look and work. I wanted to test how users would move through the design and make sure it worked well. This helped me see the design more clearly before building it and focused on making a good experience for users. <br></br> <span>What:</span> While working on the prototype, I learned how to use Figma’s prototyping tools, like making navigation flows and adding animations. I practiced how users would interact with the design, making it feel more real and dynamic. <br></br> <span>How:</span> The prototype helped me see the design in action, and using Figma’s tools showed me how important user flow and interaction are. I now feel more confident in making interactive prototypes. I’ve learned the basics, and this will help me in future projects. Next time, I can explore more advanced features in Figma to make my prototypes even better and more realistic.",
            "images": [
              "./assets/images/projects/portfolio/interactive.png"
            ]
          },
          {
            "id": "4",
            "title": "mobile responsiveness",
            "description": "<span>Why:</span> I made my <a href='https://sanderdehaar.github.io/portfolio-sm3/' target='_blank'>portfolio<i class='fa-solid fa-arrow-right'></i></a> mobile responsive because I want to give my user the option to use any device. I wanted to make sure my portfolio works well on all screen sizes. <br></br> <span>What:</span> During the process, I had to make design decisions like changing buttons and text size based on the screen size. This helped me apply user-centered design principles, ensuring that the design is functional and easy to use on both mobile and desktop. <br></br> <span>How:</span> Making my portfolio responsive was not too difficult, but it helped me improve my web development skills. It also gave me a chance to explore how to create interactive and engaging media products that work well across different devices. This experience made me better at designing and developing websites with users in mind.",
            "images": [
              "./assets/images/projects/portfolio/mobile1.png",
              "./assets/images/projects/portfolio/mobile2.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "github",
            "description": "<span>Why:</span> I created a <a href='https://github.com/sanderdehaar/portfolio-sm3' target='_blank'>GitHub<i class='fa-solid fa-arrow-right'></i></a> repository to keep track of all my project files and versions. I also added a readme to help others understand what my repository is about. This was helpful because I used GitHub Pages to host my website, which gave me a working URL. <br></br> <span>What:</span> The readme explained the purpose of the repository, and using GitHub Pages allowed me to quickly publish and test my website online. <br></br> <span>How:</span> By using GitHub and GitHub Pages, I was able to manage my project better and make it accessible online. This process helped me keep everything organized and gave me a simple way to share my website with others.",
            "images": [
              "./assets/images/projects/portfolio/github_portfolio.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "wireframes home",
            "description": "<span>Why:</span> I created mid-fidelity <a href='https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> to explore the design layout and functionality based on the <a href='https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1' target='_blank'>moodboard<i class='fa-solid fa-arrow-right'></i></a> I made. This helped me see how the design would look and work before adding more details. <br></br> <span>What:</span> I used the moodboard to guide my wireframe design. The wireframes helped me focus on the structure and layout without getting distracted by colors or images. <br></br> <span>How:</span> The wireframes helped me plan the layout and test the design’s flow. This step made it easier to improve the design before adding more details later.",
            "images": [
              "./assets/images/projects/portfolio/wireframes.png"
            ]
          },
          {
            "id": "2",
            "title": "wireframes low",
            "description": "<span>Why:</span> I chose the design wireframe I liked and built the full page based on the flow/design <a href='./assets/images/projects/portfolio/documents/testing_document.pdf' target='_blank'>testing<i class='fa-solid fa-arrow-right'></i></a> I did earlier. I wanted to turn my idea into a real layout and see how it would work in practice. <br></br> <span>What:</span> I worked through the first stage of the homepage, making changes based on the insights from the testing. This helped me see how the design could be improved. <br></br> <span>How:</span> By using the insights to improve the design, I felt more confident about how the homepage was coming together and had clear ideas for future changes.",
            "images": [
              "./assets/images/projects/portfolio/wireframe_full1.png",
              "./assets/images/projects/portfolio/wireframe_full2.png"
            ]
          },
          {
            "id": "3",
            "title": "wireframes high",
            "description": "<span>Why:</span> I turned the <a href='https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> into high-fidelity versions to focus on details and improve the design. <br></br> <span>What:</span> I added more details to the wireframes, making them look more like the final design. <br></br> <span>How:</span> This process helped me realize how important user feedback is early on, as it helped me make better design choices.",
            "images": [
              "./assets/images/projects/portfolio/wireframe_high1.png",
              "./assets/images/projects/portfolio/wireframe_high2.png",
              "./assets/images/projects/portfolio/wireframe_high3.png"
            ]
          },
          {
            "id": "4",
            "title": "wireframes updated",
            "description": "<span>Why:</span> I chose the design <a href='https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1' target='_blank'>wireframe<i class='fa-solid fa-arrow-right'></i></a> I liked and built the full page to see how it would work in real life. I wanted to turn my idea into something more practical and see how everything would fit together. <br></br> <span>What:</span> I worked on the homepage, making changes based on my teacher's feedback. My teacher suggested making the 'Let's connect' section more eye-catching, using different buttons on the project page, and adding icons for the links. <br></br> <span>How:</span> The changes helped improve the design. By testing the design and using feedback, I could see where things needed to be better. These steps made me feel more confident in my choices, and now I have clear ideas for further improvements.",
            "images": [
              "./assets/images/projects/portfolio/design_feedback1.png",
              "./assets/images/projects/portfolio/updated1.png",
              "./assets/images/projects/portfolio/updated2.png",
              "./assets/images/projects/portfolio/updated3.png"
            ]
          },
          {
            "id": "5",
            "title": "development",
            "description": "<span>Why:</span> I started developing by setting up a <a href='https://github.com/sanderdehaar/portfolio-sm3' target='_blank'>GitHub<i class='fa-solid fa-arrow-right'></i></a> and organizing my workspace with the right folder structure. I followed my Figma design and used ChatGPT to help speed up my coding process. I also added an animation library and FontAwesome for better user experience and easier embedding. I wanted to make sure the project was well-structured and efficient. <br></br> <span>What:</span> My teacher gave feedback that my coding structure was good, but suggested I learn more about frameworks, like modules and their structure. I didn’t face many problems, but I asked for feedback on how I could improve my coding skills and avoid bad habits. <br></br> <span>How:</span> This feedback made me realize I could improve by looking deeper into frameworks in the future. Although the process wasn’t too hard because of my experience, I’m eager to expand my skills and knowledge to create even better projects.",
            "images": [
              "./assets/images/projects/portfolio/development1.png",
              "./assets/images/projects/portfolio/development2.png",
              "./assets/images/projects/portfolio/development3.png"
            ]
          },
          {
            "id": "6",
            "title": "the website",
            "description": "<span>Why:</span> After getting feedback from my teacher, I realized the project page on the <a href='https://sanderdehaar.github.io/portfolio-sm3/' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a> needed some improvements to make it clearer and easier to use. <br></br> <span>What:</span> My teacher suggested making the tabs more obvious so that users know they can click on them. For the learning outcomes section, I was advised to create different sections for each topic to make the page more organized. <br></br> <span>How:</span> These changes would help make the page more user-friendly and easier to navigate. By making the tabs clearer and organizing the learning outcomes, the design will be easier to understand and more effective. This feedback will help me keep improving the design in the next steps.",
            "images": [
              "./assets/images/projects/portfolio/website_feedback3.png",
              "./assets/images/projects/portfolio/website_feedback1.png",
              "./assets/images/projects/portfolio/website_feedback2.png",
              "./assets/images/projects/portfolio/website_feedback4.png"
            ]
          },
          {
            "id": "7",
            "title": "portfolio structure",
            "description": "<span>Why:</span> My teacher gave feedback on the <a href='https://sanderdehaar.github.io/portfolio-sm3/' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a> to make the 'why, what, & how' method easier to see and understand. The 'Learning Outcomes' heading on desktop didn’t fit well, and the links in the learning outcomes needed to be clearer. Also, I should add more text to the project introduction for better context. <br></br> <span>What:</span> The feedback was to make the 'why, what, & how' method more visible. On desktop, I should remove the 'Learning Outcomes' heading and add an icon to the links to make them stand out. I also need to show more text in the introduction to give more details. <br></br> <span>How:</span> These changes will make the page easier to read and understand. Adding icons and more text will help make the design clearer and more helpful for users. This feedback really helped my design.",
            "images": [
              "./assets/images/projects/portfolio/website_feedback5.png",
              "./assets/images/projects/portfolio/structure1.png",
              "./assets/images/projects/portfolio/structure2.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "communication",
            "description": "<span>Why:</span> During the process of creating my portfolio, I stayed in contact with my teachers and regularly asked for feedback. This feedback was essential in helping me make informed decisions about both my work and the development of my professional skills. <br><br> <span>What:</span> By regularly consulting my teachers, I was able to involve a stakeholder (my teacher) who provided advice and feedback on the decisions I was making. This was valuable in shaping my project in a professional manner and improved the overall quality of my work. <br><br> <span>How:</span> This process helped me realize the importance of feedback and communication in achieving a professional standard. However, I noticed that while time management and work ethic were effective, I could improve my planning next time by scheduling my tasks more efficiently. This would help me stay organized and streamline my work process, especially when working solo.",
            "images": []
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "future portfolio",
            "description": "<span>Why:</span> For this portfolio, I wanted to create something I could use for my internship or easily adapt for an upcoming internship. My goal was to make it professional and relevant to work and contact, rather than project-based. I aimed to design it in a way that would stand out to potential employers. <br><br> <span>What:</span> To achieve this, I focused on aligning the portfolio with current design trends. I made sure the structure was clean and professional, highlighting my skills and contact information to make it easy for potential employers to see my work and get in touch. <br><br> <span>How:</span> By creating a portfolio with a professional approach and modern trends, I am more confident it will help me get a good internship. I focused on the details that would make my portfolio stand out and appeal to companies in my field.",
            "images": []
          },
          {
            "id": "2",
            "title": "career day/internship",
            "description": "<span>Why:</span> I went to the career day to understand the real work world better. Meeting people who work in the field gave me important knowledge that isn’t in books or online. This helped me see which skills I need and gave me more confidence in my career path. <br><br> <span>What:</span> I attended the career day to learn more about front-end development. At the event, I stood at companies like Handpicked and talked about their work. I asked questions about their projects and internships, which gave me a better idea of what companies look for in a developer. <br><br> <span>How:</span> Going to the career day helped shape my skills and mindset. By talking with people who have real experience, I learned what I should focus on next. Speaking with companies gave me insight into potential internships and a clear view of the steps I need to take to grow in this field.",
            "images": []
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "moodboard",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1"
          },
          {
            "text": "prototype",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1"
          },
          {
            "text": "wireframes",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/VzoC5vZwlzW39b4PClFRA0/Portfolio-semester-3?node-id=0-1&t=GRdmfxArJrvKJf0A-1"
          },
          {
            "text": "github",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/sanderdehaar/portfolio-sm3"
          },
          {
            "text": "testing flow/design",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/portfolio/documents/testing_document.pdf"
          },
          {
            "text": "website",
            "icon": "fa-solid fa-paperclip",
            "link": "https://sanderdehaar.github.io/portfolio-sm3/"
          }
        ]
      }
    },
    {
      "name": "customer",
      "title": "client work",
      "banner": {
        "backgroundImage": "./assets/images/projects/client/desert.avif",
        "bannerImage": "./assets/images/projects/client/banner_image.png",
        "heading": "client work",
        "color": "#F3804D"
      },
      "information": {
        "title": "project Information",
        "description": "Read about my client project I did with my group were we created a fast fashion solution product",
        "mockupImage": "./assets/images/projects/client/banner_mockup.png",
        "fullDescription": "This project is about finding a solution for fast fashion aimed at teenagers aged 15 to 17. Fast fashion here means the quick and affordable production of trendy clothes, which often has environmental impacts. In this project, we use agile methods like Scrum, working in sprints with retrospectives to review progress. We’re also using the Double Diamond method, which gives us a clear process to follow. Our goal is to understand the issues with fast fashion and create a product that addresses these challenges."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "ripping the brief",
            "description": "<span>Why:</span> We started by ripping the brief to fully understand the client’s problem and asked our client some <a href='./assets/images/projects/client/documents/transcript_problem.pdf' target='_blank'>questions<i class='fa-solid fa-arrow-right'></i></a> based on the problem to identify which areas needed more research. I focused on researching our target audience because understanding their needs and behaviors was crucial for creating a design that would resonate with them. <br></br> <span>What:</span> I began with a literature study on our target group. I set up a shared <a href='./assets/images/projects/client/documents/research_document.pdf' target='_blank'>research document<i class='fa-solid fa-arrow-right'></i></a> in Teams to organize and present my findings clearly. We focused on one main question, and I researched one sub-question with five smaller questions. My research aimed to understand why teenagers buy fast fashion, what motivates them, and why they continue despite the negative environmental and ethical impacts. <br></br> <span>How:</span> This research helped us understand that teenagers prioritize price, trends, and convenience when shopping for fast fashion, but are often unaware of the ethical and environmental issues involved. They can be influenced by marketing and education, and the main barriers they face are high costs and limited options for stylish alternatives. This deep understanding of our audience helped guide our design choices and confirmed the importance of focusing on their real needs and behaviors.",
            "images": [
              "./assets/images/projects/client/diamond.png",
              "./assets/images/projects/client/literature_research.png"
            ]
          },
          {
            "id": "2",
            "title": "lotus blossom",
            "description": "<span>Why:</span> To come up with ideas for our research, we needed a method that would help us think in different ways and explore new ideas. We used the Lotus Blossom method, which started with our main goal: making fast fashion less attractive. This method helped us break the problem down and look at it from different sides. <br></br> <span>What:</span> We started by brainstorming ideas around our main goal with the group. I wrote down my thoughts and expanded on them. The Lotus Blossom method helped us come up with several ideas by organizing our thoughts and building on each one. We also used Brain Writing to get more ideas from everyone in the group. <br></br> <span>How:</span> This method helped us think of new ways to reach our goal. It was a good way to generate ideas, and I would definitely recommend it for future projects because it helps you focus on important points. After showing our teacher the Lotus Blossom and Brain Writing methods, they advised us to apply co-creation and research methods to each idea with users, do both primary and secondary research for each idea, and have a clear concept before talking to the target audience.",
            "images": [
              "./assets/images/projects/client/lotus_blossom.png",
              "./assets/images/projects/client/feedback_lotus.png"
            ]
          },
          {
            "id": "3",
            "title": "brainwriting",
            "description": "<span>Why:</span> Another method we used to come up with ideas was the Brainwriting method. This method helped us explore many ideas and find possible solutions for our concepts. It encouraged everyone in the group to think creatively and share their ideas. <br></br> <span>What:</span> Each member of our group started by writing down their own ideas on our topic. I wrote my ideas down too. After that, we exchanged our ideas and built on each other’s thoughts for several rounds. This allowed us to develop a wider range of ideas. <br></br> <span>How:</span> The Brainwriting method helped us think of many different possibilities for our concept. It was really useful for expanding on each other's ideas, and I would recommend using it in the future for idea generation.",
            "images": [
              "./assets/images/projects/client/brainwriting.png"
            ]
          },
          {
            "id": "4",
            "title": "gamification prototype",
            "description": "<span>Why:</span> Based on the <a href='./assets/images/projects/client/documents/research_document.pdf' target='_blank'>research<i class='fa-solid fa-arrow-right'></i></a> I did with my team, I worked on the gamification prototype, focusing on the homepage, level page, and global styling. I wanted to bring the features of tiered rewards and a sharing option into the design. These elements came from our competitor analysis and global research, which gave us insights into what could work well in our app. <br></br> <span>What:</span> For the prototype, I created the homepage and level page and applied game mechanics like rewards and sharing options. We based these ideas on our research of successful gamification features. <br></br> <span>How:</span> After getting feedback from our teacher, I learned that we needed to better define the 'why' behind the app. We came up with the idea of a reward system to answer this.",
            "images": [
              "./assets/images/projects/client/gamification1.png",
              "./assets/images/projects/client/gamification2.png"
            ]
          },
          {
            "id": "5",
            "title": "pov & hmw",
            "description": "<span>Why:</span> From the problem statement, we created the POV (Point of View): 'As a teenager, I want to buy cheap and trendy clothes so that I fit in.' This helped us focus on the user's needs and develop a clear direction for the project. <br></br> <span>What:</span> After establishing the POV, I contributed ideas to brainstorm solutions. We created multiple HMW (How Might We) questions based on these solutions to guide our design process. <br></br> <span>How:</span> The POV and HMW process helped me think critically about user needs and develop solutions that directly addressed the problem.",
            "images": [
              "./assets/images/projects/client/pov_hmw.png"
            ]
          },
          {
            "id": "6",
            "title": "concept document",
            "description": "<span>Why:</span> The concept <a href='./assets/images/projects/client/documents/concept_document.pdf' target='_blank'>document<i class='fa-solid fa-arrow-right'></i></a> was essential for keeping the project on track and aligned with the professional standards required. It helped us present a clear, well-organized overview to the client and our team. <br></br> <span>What:</span> For the concept document, I created the entire layout and organized the research findings, including the personas I developed. I also included the ideation process, such as the Lotus Blossom and Brainwriting methods. This helped us keep everything in one place and made it easy to track our progress. The document provided a clear timeline and overview, helping us identify our next steps and ensuring that we stayed focused and organized. <br></br> <span>How:</span> The document was very helpful because it acted as a structured reference point for everyone involved. It made it easier to communicate our ideas and progress with the team and the client, keeping everything organized in one accessible place. I really liked this document, as it gave us a clear overview of where we were in the process and what still needed to be done.",
            "images": [
              "./assets/images/projects/client/concept_document.png"
            ]
          },
          {
            "id": "7",
            "title": "moodboard",
            "description": "<span>Why:</span> We made a <a href='https://www.figma.com/design/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=505-2&t=XgzmbUospQ8eoKow-1' target='_blank'>moodboard<i class='fa-solid fa-arrow-right'></i></a> based on the concept that our client liked with upcycling with your bestie. It helped us get on the same page and see what designs are already out there for our target audience. <br></br> <span>What:</span> We looked at different designs from other games to understand what’s popular in the market. Our main finding was that a simple, cartoonish style is used by many games, and it felt like the best fit for ours. <br></br> <span>How:</span> By putting these ideas together on a moodboard, we could easily compare them and decide that the simple, cartoonish style would work well for our game.",
            "images": [
              "./assets/images/projects/client/moodboard.png"
            ]
          },
          {
            "id": "8",
            "title": "demo",
            "description": "<span>Why:</span> We created a <a href='https://www.figma.com/proto/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=420-4&starting-point-node-id=420%3A4&t=Ns4zsGAdNgtfgqYi-1' target='_blank'>demo<i class='fa-solid fa-arrow-right'></i></a> to test the product before fully developing it. My goal was to make sure the design was functional and the flow of the game felt natural. <br></br> <span>What:</span> I connected the conversation and store parts to the other pages, ensuring the design flowed well. This gave us a preview of how the game would work. <br></br> <span>How:</span> By linking the pages together, I was able to test the transitions between different sections of the game and ensure the design stayed consistent.",
            "images": [
              "./assets/images/projects/client/demo.png"
            ]
          },
          {
            "id": "9",
            "title": "coding the flow",
            "description": "<span>Why:</span> I wanted to create a <a href='https://git.fhict.nl/I522385/upcycling-with-besties' target='_blank'>dynamic chat<i class='fa-solid fa-arrow-right'></i></a> flow with customer animations based on different levels. To do this, I needed to ensure that the chat progress and animation states would be saved, even when the user refreshes the page. This taught me how to preserve user progress across sessions using localStorage. <br></br> <span>What:</span> I used localStorage to save the current index and the state of the chat. This allowed me to load and update the chat flow without losing progress. I also used async functions to fetch data and handle errors. Additionally, I integrated customer animations with CSS keyframes, which gave me hands-on experience with both JavaScript and CSS animations. <br></br> <span>How:</span> By storing the `currentIndex` and `checked` state in localStorage, I was able to load the chat flow dynamically and maintain the user's progress even if they refreshed the page. I used setTimeouts to manage delays for animations and transitions. The animation function allowed me to trigger different animations depending on the direction of movement, adding smooth transitions to the customer actions. This taught me how to combine state management, asynchronous data fetching, and animation techniques in a seamless flow. ",
            "images": [
              "./assets/images/projects/client/coding.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "co-pilot",
            "description": "<span>Why:</span> Writing and fixing code can take a lot of time, especially when working in teams. After using GitHub Copilot, I realized it helps make this process faster and more efficient. <br></br> <span>What:</span> Copilot suggests code, helps debug errors, and provides quick solutions. It also makes it easier to understand other people's code and add comments where needed. <br></br>  <span>How:</span> I use Copilot while coding to get quick suggestions for functions and logic. When I get stuck on a problem, it suggests possible solutions, saving time. I also use it to debug errors by checking the suggestions Copilot provides and adjusting my code accordingly. This helps me write clean, understandable code that my team can use.",
            "images": [
              "./assets/images/projects/client/copilot.png"
            ]
          },
          {
            "id": "2",
            "title": "usage of version control",
            "description": "<span>Why:</span> During our project, I noticed that managing our code effectively was crucial for smooth teamwork. After some feedback, I took the lead in guiding everyone on using <a href='https://git.fhict.nl/I522385/upcycling-with-besties' target='_blank'>GitLab<i class='fa-solid fa-arrow-right'></i></a> properly to avoid version control issues. <br></br>  <span>What:</span> I focused on helping the team understand how to work with branches, commit changes, merge their work, and resolve merge errors. This made our collaboration more efficient and reduced the risk of conflicts in the code. <br></br>  <span>How:</span> I provided guidance on how to create and manage branches in GitLab, explained how to commit regularly, and helped the team navigate merge conflicts when they happened. This ensured that everyone was able to collaborate smoothly and keep the project on track.",
            "images": [
              "./assets/images/projects/client/merge_conflict.png",
              "./assets/images/projects/client/version_control.png"
            ]
          },
          {
            "id": "3",
            "title": "adding comments",
            "description": "<span>Why:</span> I added <a href='https://git.fhict.nl/I522385/upcycling-with-besties' target='_blank'>comments<i class='fa-solid fa-arrow-right'></i></a> to my code to make it easier for my co-workers to understand and follow the process. This helped ensure smooth collaboration and improved our teamwork. <br></br> <span>What:</span> I commented on key parts of my code to explain what was happening. This way, my co-workers didn’t need a full explanation every time they looked at my code. <br></br> <span>How:</span> By adding clear and helpful comments, I made my code more understandable. This allowed the team to work more smoothly and understand my process without needing extra explanations.",
            "images": [
              "./assets/images/projects/client/comments.png"
            ]
          },
          {
            "id": "4",
            "title": "merge conflicts",
            "description": "<span>Why:</span> Some of my group members were inexperienced with GitLab and faced merge conflicts during the project. I wanted to help them solve these problems so they could work more efficiently. <br></br> <span>What:</span> I showed my teammates how to solve merge conflicts in GitLab. After explaining the process to them, they were able to handle conflicts on their own. <br></br> <span>How:</span> By teaching them the process, I ensured the team could manage version control better, which improved our workflow and reduced the chances of issues in the future.",
            "images": [
              "./assets/images/projects/client/comments.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "gamification prototype",
            "description": "<span>Why:</span> After getting feedback from our teacher, I realized that we needed to refine the concept behind our <a href='https://www.figma.com/design/YA70evreMaYHq1yYAFF7H5/Gamification-idea?node-id=0-1&t=aS6ViFNsqPeN7NEn-1' target='_blank'>prototype<i class='fa-solid fa-arrow-right'></i></a>. We identified the 'why' of the project and used this to develop a clearer vision for the app. <br></br> <span>What:</span> Our feedback session led to the idea of adding a reward system to better engage the target audience. This helped us refine our approach and make the prototype more aligned with the needs of our users. <br></br> <span>How:</span> I contributed to refining the prototype and ensuring that it reflected the new direction we decided on, making it more clear and user-focused.",
            "images": [
              "./assets/images/projects/client/gamification_mobiles.png",
              "./assets/images/projects/client/reward.png",
              "./assets/images/projects/client/gamification1.png",
              "./assets/images/projects/client/gamification2.png"
            ]
          },
          {
            "id": "2",
            "title": "artificial intelligence",
            "description": "<span>Why:</span> My first draft of text is often not as clear as I want it to be. ChatGPT helped me improve and rewrite it quickly. <br></br>  <span>What:</span> I used ChatGPT to rewrite text after I finished typing it. This made it easier to understand and sound better. <br></br>  <span>How:</span> After I wrote a draft, I asked ChatGPT to suggest changes or rewrite parts that needed fixing. This helped me quickly improve my writing and make sure it worked well for the project.",
            "images": [
              "./assets/images/projects/client/text.png"
            ]
          },
          {
            "id": "3",
            "title": "store design",
            "description": "<span>Why:</span> I wanted to take the <a href='https://www.figma.com/design/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=505-2&t=XgzmbUospQ8eoKow-1' target='_blank'>moodboard<i class='fa-solid fa-arrow-right'></i></a> style we chose and bring it into our game <a href='https://www.figma.com/design/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=505-2&t=XgzmbUospQ8eoKow-1' target='_blank'>design<i class='fa-solid fa-arrow-right'></i></a> . The goal was to create a setting where players could interact with the design and experience the upcycling process. After receiving feedback from our client, I also wanted to add animation and a conversation to make the experience more engaging. <br></br> <span>What:</span> I recreated a store in the game where customers come in to upcycle their items, using the simple, cartoonish style from the moodboard. Based on the feedback, I added an animation where the customer walks into the store, and I designed a conversation between the customer and the store. <br></br> <span>How:</span> I implemented the animation of the customer walking into the store to make the interaction more dynamic. I also created a conversation flow, where the customer talks about their product, adding more depth to the experience. This allowed me to stay true to the chosen style while improving the game with interactive elements based on the client’s suggestions.",
            "images": [
              "./assets/images/projects/client/shop1.png",
              "./assets/images/projects/client/shop2.png",
              "./assets/images/projects/client/conversation.png"
            ]
          },
          {
            "id": "4",
            "title": "usability testing",
            "description": "<span>Why:</span> We wanted to ensure our product was usable for our target group and identify any flaws in the user experience we did a <a href='./assets/images/projects/client/documents/usability_testing.pdf' target='_blank'>usability test<i class='fa-solid fa-arrow-right'></i></a>. We aimed to improve our product before finalizing it, ensuring it met user expectations and provided a smooth experience. <br></br> <span>What:</span> I participated in usability testing with two other group members. We focused on gathering feedback from four individuals within our target group, asking them to test the final product and identify any areas for improvement. The feedback was invaluable for identifying non-intended errors, as well as suggestions, like adding more items and showing customers wearing their upcycled clothing. <br></br> <span>How:</span> We observed the testers interacting with the product, noted their feedback, and discussed possible improvements. After the testing, we analyzed the suggestions and made changes to the product, such as the addition of more items and displaying customers in upcycled clothes. This testing process really helped us refine the user experience and align it with our target group’s preferences.",
            "images": [
              "./assets/images/projects/client/testing.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "team charter",
            "description": "<span>Why:</span> As a group, we created a <a href='./assets/images/projects/client/documents/team_charter_document.pdf' target='_blank'>team charter<i class='fa-solid fa-arrow-right'></i></a>  to set clear roles, expectations, and professional standards for working together. This document helped us establish group norms and standards of quality, which are important for maintaining professionalism in the project. <br></br> <span>What:</span> The team charter outlined our roles within the team, success metrics, and consequences if something doesn’t go as planned. It also detailed our group norms and the quality of work we aim to maintain. <br></br> <span>How:</span> Creating this document was really useful because it made sure we were all on the same page about how we would collaborate. It helped us set clear guidelines for professionalism and teamwork, and I will definitely use this approach in future projects.",
            "images": [
              "./assets/images/projects/client/team_charter.png"
            ]
          },
          {
            "id": "2",
            "title": "trello",
            "description": "<span>Why:</span> To manage our tasks more effectively, we used <a href='https://trello.com/b/Mk6JKvMD/to-do' target='_blank'>trello<i class='fa-solid fa-arrow-right'></i></a>. My role was to keep the team leader updated on my progress and check if my work was done correctly. <br></br> <span>What:</span> Trello helped us organize our work by setting clear deadlines and receiving alerts. It also supported our agile work environment, where we used scrum and sprints to stay on track. <br></br> <span>How:</span> The schedule made it easy to keep everything organized and meet deadlines. However, for future projects, I would consider using a different tool for managing the agile scrum process since Trello doesn't clearly show retrospectives or provide an overview of the entire process.",
            "images": [
              "./assets/images/projects/client/trello.png"
            ]
          },
          {
            "id": "3",
            "title": "literature study",
            "description": "<span>Why:</span> Following our teacher’s recommendation, we divided the <a href='./assets/images/projects/client/documents/research_document.pdf' target='_blank'>research<i class='fa-solid fa-arrow-right'></i></a>  tasks into three parts to make the workload more manageable. By doing this, we could focus on specific areas in a methodical way and ensure we were collaborating effectively as a team. <br></br> <span>What:</span> I was responsible for researching our target audience. I structured my research by setting up a document in Teams, which allowed for efficient collaboration and easy access for the team. I focused on understanding teenagers’ behaviors and motivations regarding fast fashion. My research showed that teenagers are driven by affordability and trends, but they are largely unaware of the environmental and ethical issues associated with fast fashion. <br></br> <span>How:</span> This research process helped us understand how teenagers think and behave in the context of fast fashion. The conclusions provided valuable insights that will guide our design decisions. To validate these findings further, we would conduct surveys and create personas. This professional, team-based approach helped ensure that our project stayed organized and aligned with industry standards. I’d definitely use this method in future projects.",
            "images": [
              "./assets/images/projects/client/literature_research.png"
            ]
          },
          {
            "id": "4",
            "title": "survey",
            "description": "<span>Why:</span> I created <a href='https://docs.google.com/forms/d/e/1FAIpQLScy63tSLf9eNGVDnIvFdjQIzRDAbXeSsDvIAOutSaMDYsR3XA/viewform' target='_blank'>survey<i class='fa-solid fa-arrow-right'></i></a> questions with Justin based on the conclusions of the research <a href='./assets/images/projects/client/documents/research_document.pdf' target='_blank'>document<i class='fa-solid fa-arrow-right'></i></a>  its main question. We focused on topics like affordability, trendiness, convenience, and popular brands like Shein, Zara, and H&M. We also looked at how teens are unaware of the environmental and social impacts of fast fashion, like pollution, unethical labor, and waste. We wanted to see how education and marketing could help change their habits. The survey was designed for our target group, which is 18-24 years old. <br></br> <span>What:</span> After creating the <a href='https://docs.google.com/forms/d/e/1FAIpQLScy63tSLf9eNGVDnIvFdjQIzRDAbXeSsDvIAOutSaMDYsR3XA/viewform' target='_blank'>survey<i class='fa-solid fa-arrow-right'></i></a>, we asked our teacher for feedback on the questions. She suggested adding more brands as options and rewording some questions to make them easier to understand. After making these changes, we turned the questions into a survey and added a fun QR code to attract our target group. Our teacher also confirmed that our target group was at the school, so we put the QR code on the walls to make it easier for them to take the survey. <br></br> <span>How:</span> After receiving over 19 responses, we analyzed the data. The results showed that our target group (18-24 years old) is not very aware of fast fashion’s impact. Cost was a big factor in their purchasing decisions, and many said they would buy sustainable clothing if it were cheaper. Our survey also showed that both males and females in the 18-24 age range participated, confirming that our target group was accurate. This was very helpful because it gave us valuable insights into our target audience's habits and thoughts. I would definitely use this approach again in future projects.",
            "images": [
              "./assets/images/projects/client/survey.png",
              "./assets/images/projects/client/survey1.png",
              "./assets/images/projects/client/survey2.png",
              "./assets/images/projects/client/survey3.png",
              "./assets/images/projects/client/survey4.png",
              "./assets/images/projects/client/survey5.png",
              "./assets/images/projects/client/survey_feedback.png"
            ]
          },
          {
            "id": "5",
            "title": "persona's",
            "description": "<span>Why:</span> Based on the <a href='https://docs.google.com/forms/d/e/1FAIpQLScy63tSLf9eNGVDnIvFdjQIzRDAbXeSsDvIAOutSaMDYsR3XA/viewform' target='_blank'>survey<i class='fa-solid fa-arrow-right'></i></a>, I created two personas that represent our target group. I took the main findings from the survey and added them to these personas. This helped us focus on their needs, frustrations, and other important details. <br></br> <span>What:</span> By creating these personas, we were able to simplify and better understand the main characteristics of our target group. It helped us clearly define the people we are designing for. <br></br> <span>How:</span> These personas were very useful in finding our target group and understanding them more clearly. I would definitely use this method again for future projects to better focus on the people we want to reach.",
            "images": [
              "./assets/images/projects/client/persona1.png",
              "./assets/images/projects/client/persona2.png"
            ]
          },
          {
            "id": "6",
            "title": "competitor analysis",
            "description": "<span>Why:</span> Based on the Lotus Blossom method, we chose 'gamification' as our subject. I researched competitors to understand how they use gamification, and I focused on Starbucks' loyalty program because it has interesting gamification elements. <br></br> <span>What:</span> From my <a href='./assets/images/projects/client/documents/research_document.pdf' target='_blank'>competitor analysis<i class='fa-solid fa-arrow-right'></i></a>, I discovered that Starbucks uses tiered rewards, time-sensitive challenges, and sharing options. These strategies help them keep customers engaged and build long-term brand loyalty by turning satisfied customers into brand advocates. <br></br> <span>How:</span> These insights were really helpful for coming up with ideas for gamification in our project. The competitor analysis gave me valuable data to improve our project, and I will definitely use this research method in future projects.",
            "images": [
              "./assets/images/projects/client/competitor_analysis.png"
            ]
          },
          {
            "id": "7",
            "title": "pov & hmw",
            "description": "<span>Why:</span> The POV and HMW method was important for guiding our project in the right direction and ensuring that we were solving real problems. <br></br> <span>What:</span> By using POV and HMW, we were able to understand the user’s perspective and develop solutions that made sense. This allowed us to define the problem clearly and start brainstorming effective solutions. <br></br> <span>How:</span> The process helped me collaborate better with the team to come up with solutions and showed me the importance of defining problems before jumping into solutions. I believe this approach is essential for every project to stay focused on finding the best possible solution.",
            "images": [
              "./assets/images/projects/client/pov_hmw.png"
            ]
          },
          {
            "id": "8",
            "title": "review prototype",
            "description": "<span>Why:</span> We showed our <a href='https://www.figma.com/design/YA70evreMaYHq1yYAFF7H5/Gamification-idea?node-id=0-1&t=aS6ViFNsqPeN7NEn-1' target='_blank'>prototype<i class='fa-solid fa-arrow-right'></i></a> to the client, and after getting <a href='https://www.figma.com/design/YA70evreMaYHq1yYAFF7H5/Gamification-idea?node-id=0-1&t=aS6ViFNsqPeN7NEn-1' target='_blank'>feedback<i class='fa-solid fa-arrow-right'></i></a>, I understood the importance of aligning our ideas with client expectations and real-world application. <br></br> <span>What:</span> I presented the prototype with the mockups I created. After receiving feedback that the idea wasn't innovative enough, I reflected on how I could improve the approach. <br></br> <span>How:</span> The feedback process taught me to focus more on the underlying idea rather than just the design. I realized the importance of delivering a prototype that is both functional and innovative, with clear reasoning behind the concept..",
            "images": [
              "./assets/images/projects/client/gamification1.png",
              "./assets/images/projects/client/gamification2.png"
            ]
          },
          {
            "id": "9",
            "title": "approval idea",
            "description": "<span>Why:</span> The <a href='./assets/images/projects/client/documents/transcript_concept.pdf' target='_blank'>feedback<i class='fa-solid fa-arrow-right'></i></a> from both our teacher and client was essential to guide the project in the right direction and finalize the idea. <br></br> <span>What:</span> After reviewing the feedback, we understood the importance of applying professional standards to make the project engaging, relevant, and aligned with the client’s expectations. <br></br> <span>How:</span> The process of refining the idea and presenting it to the client helped improve the quality of the project. I helped combine the information into a clear and concise presentation that was easy to follow. Moving forward, I would keep the presentations shorter and more concise to better communicate our ideas.",
            "images": [
              "./assets/images/projects/client/concept_idea.jpg"
            ]
          },
          {
            "id": "10",
            "title": "demo present",
            "description": "<span>Why:</span> We needed to test our <a href='https://www.figma.com/proto/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=420-4&starting-point-node-id=420%3A4&t=Ns4zsGAdNgtfgqYi-1' target='_blank'>demo<i class='fa-solid fa-arrow-right'></i></a> with the client to get her feedback and refine the product before finalizing it. This would help us improve the product in line with her expectations. <br></br> <span>What:</span> We presented the demo to the client and asked for her input. She appreciated the demo and suggested features like an introduction, voiceover, and credits. <br></br> <span>How:</span> I documented the feedback and will incorporate the suggested features into the advice report, using version control to track changes and keep the project organized.",
            "images": [
              "./assets/images/projects/client/demo.png"
            ]
          },
          {
            "id": "11",
            "title": "advice report",
            "description": "<span>Why:</span> The goal of the <a href='./assets/images/projects/client/documents/advice_report.pdf' target='_blank'>advice report<i class='fa-solid fa-arrow-right'></i></a> was to provide strategic advice on how to improve and implement the 'Upcycling with Besties' game. The aim was to raise awareness about upcycling, educate users, and promote sustainable fashion. The report focuses on improving user engagement and the overall user experience by addressing key issues like responsiveness, game flow, and functionality. <br></br> <span>What:</span> I worked on this report as part of the project to provide recommendations for the game’s improvement. The report analyzed the current situation, conducted surveys, and gathered feedback to help refine the game’s design and user experience. It also included suggestions on adding features like mobile responsiveness, a badge system, and sharing options for upcycled clothing. The report also discussed risks, such as player fatigue and technical issues, and offered strategies to mitigate them. <br></br> <span>How:</span> I contributed by researching and analyzing the current state of the game, then providing recommendations to improve its functionality and user experience. What helped me was the feedback from surveys and playtesting, which gave clear insights into areas of improvement. Next time, I would focus on streamlining the game’s flow to avoid overwhelming players and ensuring smoother cross-platform compatibility. This experience taught me how to structure a report and provide actionable solutions based on research and testing.",
            "images": [
              "./assets/images/projects/client/advice_report.png"
            ]
          },
          {
            "id": "12",
            "title": "finalizing our product",
            "description": "<span>Why:</span> We wanted to ensure our <a href='https://git.fhict.nl/I522385/upcycling-with-besties' target='_blank'>product<i class='fa-solid fa-arrow-right'></i></a> was usable for our target group and identify any flaws in the user experience. We aimed to improve our product before finalizing it, ensuring it met user expectations and provided a smooth experience. <br></br> <span>What:</span> I participated in <a href='./assets/images/projects/client/documents/usability_testing.pdf' target='_blank'>usability testing<i class='fa-solid fa-arrow-right'></i></a> with two other group members. We focused on gathering feedback from four individuals within our target group, asking them to test the final product and identify any areas for improvement. The feedback was invaluable for identifying non-intended errors, as well as suggestions, like adding more items and showing customers wearing their upcycled clothing. <br></br> <span>How:</span> We observed the testers interacting with the product, noted their feedback, and discussed possible improvements. After the testing, we analyzed the suggestions and made changes to the product, such as the addition of more items and displaying customers in upcycled clothes. This testing process really helped us refine the user experience and align it with our target group’s preferences.",
            "images": [
              "./assets/images/projects/client/final.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "team charter",
            "description": "<span>Why:</span> We created a team charter to help us understand each other's strengths and weaknesses. I added my own strengths and weaknesses, as well as my core values. I also wrote down my personal goals and commitments, like improving communication within the team and enhancing our use of version control. <br></br> <span>What:</span> In the team charter, we listed our group norms, roles, success metrics, standards of quality, and consequences. This helped clarify our personal goals and how we would work together as a team. <br></br> <span>How:</span> I really liked this document because it helped me reflect on my personal growth and goals for the project. It also gave clear guidelines for the team, and I would definitely recommend creating a team charter at the start of every project to guide personal development.",
            "images": [
              "./assets/images/projects/client/team_charter.png"
            ]
          },
          {
            "id": "2",
            "title": "scrum",
            "description": "<span>Why:</span> We used an agile working method, like Scrum, and worked in sprints. Every two weeks, we did a retrospective to talk about how things were going. In the first retrospective, we realized we needed to communicate better, help each other, and make decisions faster. We also had an issue with some team members being late, so we added a strike method for accountability. <br></br> <span>What:</span> I participated by adding information to the board during sprints and retrospectives. In the second retrospective, we saw improvements, and everything went really well because we solved our issues with communication and decision-making. <br></br> <span>How:</span> This process worked well because the communication got better, and we were able to identify problems quickly through retrospectives. I’ll definitely keep using this approach in the future.",
            "images": [
              "./assets/images/projects/client/retrospectives.jpg",
              "./assets/images/projects/client/retrospectives2.jpg"
            ]
          },
          {
            "id": "3",
            "title": "presenting",
            "description": "<span>Why:</span> In sprint/retrospective meetings, I presented what I had done in stand-up sessions. This helped me improve my presenting skills for the team. <br></br> <span>What:</span> At first, I wasn’t very confident, but over time, I became better at presenting and speaking in front of others. <br></br> <span>How:</span> This experience helped me grow and improve, and I hope it will help me with presenting in a company in the future.",
            "images": [
              "./assets/images/projects/client/retrospectives.jpg",
              "./assets/images/projects/client/retrospectives2.jpg"
            ]
          },
          {
            "id": "4",
            "title": "quick problem solving",
            "description": "<span>Why:</span> I finished my tasks with the menu, the conversation, and the customer animation walking in. Afterward, I was assigned a quick problem-solving task by my teammate to improve the flow of the game. <br></br> <span>What:</span> I completed my assigned tasks and then took on a problem-solving role to help improve the overall game flow. <br></br> <span>How:</span> By stepping in and helping solve the issue, I showed leadership in taking responsibility for the team's success and ensured the game’s flow was smooth",
            "images": [
              "./assets/images/projects/client/flow.png"
            ]
          },
          {
            "id": "5",
            "title": "merge conflicts",
            "description": "<span>Why:</span> I noticed that some of my teammates were struggling with merge conflicts in GitLab. I wanted to step in and help them learn how to solve these issues themselves. <br></br> <span>What:</span> I took the time to teach them how to resolve merge conflicts and troubleshoot related issues. Once they understood the process, they were able to handle it independently. <br></br> <span>How:</span> By showing leadership and teaching my teammates, I helped improve their skills and made the team more efficient. This promoted a positive and supportive work environment.",
            "images": [
              "./assets/images/projects/client/comments.png"
            ]
          },
          {
            "id": "6",
            "title": "final presentation",
            "description": "<span>Why:</span> We needed to present our product to the client to show them what we’ve done, explain how it works, and make sure it meets their needs. The <a href='https://www.canva.com/design/DAGYyoiCdr8/FwUK-zAs88M87dysjeMfXQ/edit?utm_content=DAGYyoiCdr8&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton' target='_blank'>presentation<i class='fa-solid fa-arrow-right'></i></a> was important to show our progress and the final result of the project. <br></br> <span>What:</span> For our final presentation, I made my own slides in PowerPoint. After that, our group practiced the presentation to make sure everything went smoothly. This practice helped us know what to say and when to say it, so the presentation was organized. The main feedback from our client was very positive. She liked the idea and was excited to see it in future plans, like adding a social media feature where players could 'upcycle with your bestie' and post their upcycled items. She also suggested adding a feature in the game where the customer wears upcycled items and adding some information about the item at the end to teach the user about it. <br></br> <span>How:</span> I made sure my slides were clear and easy to understand. Practicing with my group helped us work together better and make sure we were ready. What helped me was the feedback from my group, which made me realize some things I could improve. Next time, I would spend more time making the slides look even better and practice more to feel even more confident. This experience helped me improve my teamwork and presentation skills, and I learned how important it is to prepare well and work together for a successful presentation.",
            "images": [
              "./assets/images/projects/client/final_presentation.png"
            ]
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "gamification prototype",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/YA70evreMaYHq1yYAFF7H5/Gamification-idea?node-id=0-1&t=aS6ViFNsqPeN7NEn-1"
          },
          {
            "text": "survey",
            "icon": "fa-solid fa-file",
            "link": "https://docs.google.com/forms/d/e/1FAIpQLScy63tSLf9eNGVDnIvFdjQIzRDAbXeSsDvIAOutSaMDYsR3XA/viewform"
          },
          {
            "text": "research document",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/research_document.pdf"
          },
          {
            "text": "competitor analysis",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/research_document.pdf"
          },
          {
            "text": "concept document",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/concept_document.pdf"
          },
          {
            "text": "team charter",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/team_charter_document.pdf"
          },
          {
            "text": "transcript problem",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/transcript_problem.pdf"
          },
          {
            "text": "transcript concept",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/transcript_concept.pdf"
          },
          {
            "text": "trello",
            "icon": "fa-brands fa-trello",
            "link": "https://trello.com/b/Mk6JKvMD/to-do"
          },
          {
            "text": "moodboard",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=505-2&t=XgzmbUospQ8eoKow-1"
          },
          {
            "text": "figma demo",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/proto/iP9kEw3gbpeqoTHmEkh416/Prototype-Project?node-id=420-4&starting-point-node-id=420%3A4&t=Ns4zsGAdNgtfgqYi-1"
          },
          {
            "text": "gitlab",
            "icon": "fa-brands fa-gitlab",
            "link": "https://git.fhict.nl/I522385/upcycling-with-besties"
          },
          {
            "text": "usability testing",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/usability_testing.pdf"
          },
          {
            "text": "advice report",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/client/documents/advice_report.pdf"
          },
          {
            "text": "presentation",
            "icon": "fas fa-presentation",
            "link": "https://www.canva.com/design/DAGYyoiCdr8/FwUK-zAs88M87dysjeMfXQ/edit?utm_content=DAGYyoiCdr8&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton"
          }
        ]
      }
    },
    {
      "name": "challenges",
      "title": "challenges",
      "banner": {
        "backgroundImage": "./assets/images/projects/challenges/banner_color.png",
        "bannerImage": "./assets/images/projects/challenges/banner_image.png",
        "heading": "challenges",
        "color": "#9F9F9F"
      },
      "information": {
        "title": "project Information",
        "description": "Read about all my challenges I have done to challenge myself and upgrade my knowledge about web development and other interesst",
        "mockupImage": "./assets/images/projects/challenges/banner_mockup.png",
        "fullDescription": "On this page, you can see all the challenges I've taken on to push myself and grow my skills. I've worked on various projects to improve my knowledge in web development and other exciting areas like UX/UI design. Each challenge has helped me learn something new, allowing me to try out different ideas, tools, and techniques. By taking on these challenges, I've aimed to build my confidence, expand my abilities, and become better at creating interactive and user-friendly websites. I'm passionate about learning and enjoy testing myself in these different areas, always looking to improve and bring fresh ideas to my work."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "blender character",
            "description": "<span>Why:</span> I wanted to build my skills in 3D character creation, focusing on sculpting and rendering techniques to create a character that fits a “party animal” style. By challenging myself to bring this concept to life, I developed foundational sculpting skills, along with UV mapping and texturing methods. <br></br> <span>What:</span> For this project, I designed a raccoon character, starting with sculpting tools to create the initial form. I also explored techniques to optimize geometry, which helped me make the model efficient for rendering. After creating the base shape, I moved on to UV mapping, painting, and adding details like fur with a particle system in Blender. <br></br> <span>How:</span> This process introduced me to core sculpting tools (like add, remove, and grab) and UV mapping basics, expanding my skill set. I set up lighting to make the scene look polished, learning how these techniques contribute to a professional look.",
            "images": [
              "./assets/images/projects/challenges/blender.png"
            ]
          },
          {
            "id": "2",
            "title": "api retrieve",
            "description": "<span>Why:</span> The task of retrieving data from an <a href='https://github.com/sanderdehaar/pokemon_game_template' target='_blank'>API<i class='fa-solid fa-arrow-right'></i></a> was important because it allowed me to understand how to connect to external sources and integrate their data into a digital product. This is a crucial skill for front-end development and for planning how to make a product dynamic and interactive. <br></br> <span>What:</span> I set myself a small challenge to retrieve data from an API in JSON format and display it in cards on a webpage. I used a simple API and successfully integrated the data without any issues. This process was straightforward, and I didn't encounter any major problems during the task. It helped me become more comfortable with fetching and displaying data in web development. <br></br> <span>How:</span> This task was helpful because it gave me practical experience working with APIs, which is important for front-end development. It allowed me to see how data is retrieved and displayed dynamically, a key part of building interactive websites. In the future, I plan to work with more complex APIs and integrate multiple databases into one project. This experience has also motivated me to improve my skills in handling larger, more complex data sets.",
            "images": [
              "./assets/images/projects/challenges/api.png"
            ]
          },
          {
            "id": "3",
            "title": "api usability",
            "description": "<span>Why:</span> The task was important because it allowed me to learn how to use data from an <a href='https://github.com/sanderdehaar/pokemon_game_template' target='_blank'>API<i class='fa-solid fa-arrow-right'></i></a> in a practical and interactive way. By creating a game where users can select their Pokémon and battle, I could understand how to retrieve, process, and display API data, which is a key skill for front-end development. <br></br> <span>What:</span> I retrieved data from an API and used it to build a duel-like game where users can select their Pokémon, view information about them, and fight against an opponent. This helped me understand how to work with JSON data in a more practical context and turn it into an interactive element on a webpage. <br></br> <span>How:</span> This project was helpful because I applied my knowledge of API data in a more interactive setting. I learned how to handle JSON data and integrate it into a game, allowing me to practice data manipulation and make the content dynamic. The experience was useful for improving my skills in API integration and interactive web features. In the future, I want to create even more complex projects with APIs and expand my knowledge of how to make dynamic content on websites.",
            "images": [
              "./assets/images/projects/challenges/api3.png",
              "./assets/images/projects/challenges/api2.png",
              "./assets/images/projects/challenges/api4.png"
            ]
          },
          {
            "id": "4",
            "title": "basics react",
            "description": "<span>Why:</span> I wanted to learn the basics of using a framework, so I chose React. This was important because understanding frameworks is essential for creating modern web applications, and I wanted to build my skills in a framework widely used in front-end development. <br></br> <span>What:</span> I learned how to use React with Vite to set up a <a href='https://github.com/sanderdehaar/the_lost_archive' target='_blank'>project<i class='fa-solid fa-arrow-right'></i></a>. I worked with basic components, such as buttons, carousels, and text elements. I also explored how to use the React Router to navigate between pages. This gave me hands-on experience with setting up a project, organizing components, and managing page navigation. <br></br> <span>How:</span> This experience helped build my confidence in working with frameworks. I learned how to structure a project, create reusable components, and navigate between pages, which are essential skills for front-end development. In the future, I would like to explore other frameworks and understand the differences between them to improve my skills and find the best tools for different projects.",
            "images": [
              "./assets/images/projects/challenges/react1.png",
              "./assets/images/projects/challenges/react2.png",
              "./assets/images/projects/challenges/react3.png"
            ]
          },
          {
            "id": "5",
            "title": "react 3D object",
            "description": "<span>Why:</span> I wanted to learn how to implement 3D objects into a webpage and make them interactive. This was important because integrating 3D elements can enhance the user experience on websites, and I wanted to understand how to combine React with 3D objects. <br></br> <span>What:</span> I continued developing my React template and learned how to implement a 3D object by using a library that allows interaction with the object, such as changing its rotation and adding additional objects. I used ChatGPT for guidance on how to correctly import and integrate the 3D object. I also faced issues with exporting my Blender file correctly, as it needed a scene.bin file. However, I learned the proper export settings and can now successfully import Blender objects into my project. <br></br> <span>How:</span> This experience helped me understand how to work with 3D models in a web environment, and I now know how to use the library to make 3D objects interactive. I also solved the problem of exporting and importing Blender files correctly, which has improved my workflow. In the future, I would like to explore integrating a database with interactive 3D objects to store and manage data dynamically.",
            "images": [
              "./assets/images/projects/challenges/react5.png",
              "./assets/images/projects/challenges/react4.png",
              "./assets/images/projects/challenges/react6.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "work enviroment",
            "description": "<span>Why:</span> To create a better work environment, I focused on making my <a href='https://github.com/sanderdehaar/the_lost_archive' target='_blank'>code<i class='fa-solid fa-arrow-right'></i></a> clear and reusable for others. This is important because in companies, multiple people often work on the same codebase, so everyone needs to understand each part easily. Commenting my code helps with this. <br></br> <span>What:</span> I made sure to comment on my code wherever necessary, explaining parts that might be unclear to others. This way, anyone who reads it will know what each section does and how to use it. <br></br> <span>How:</span> One of my colleagues asked me do you comment your code enough? And i asked myself this question and the case for my was that I didnt do it much, but now I see how small actions, like writing clear comments, make a big difference in a collaborative setting and even when your work alone on a project.",
            "images": [
              "./assets/images/projects/challenges/react3.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "blender character",
            "description": "<span>Why:</span> I wanted to learn 3D sculpting and improve my skills in character creation, so I chose to design a raccoon character in a “party animal” style. This gave me a chance to practice using sculpting tools and learn how to apply feedback to improve my work. <br></br> <span>What:</span> I started by shaping the character’s head and body, using sculpting tools to create a raccoon form that matched the style. After a first pass, I showed it to my teacher, who advised me to make the nose more rounded and adjust the mouth indentation to fit the character style better. Based on that, I refined the head structure and continued with UV mapping and texturing. I painted the character using Blender and added fur with a particle system, lighting from a free source, and a simple, curved background. <br></br> <span>How:</span> Working on this character taught me key sculpting basics like add, remove, and grab tools, and also how to UV-map and paint. The feedback process was helpful for learning how to adjust my designs based on input, and I want to keep improving on sculpting techniques, painting, and eventually, adding animations.",
            "images": [
              "./assets/images/projects/challenges/blender.png",
              "./assets/images/projects/challenges/blender1.png",
              "./assets/images/projects/challenges/blender_feedback.png",
              "./assets/images/projects/challenges/blender2.png",
              "./assets/images/projects/challenges/blender3.png"
            ]
          }
        ],
        "4": [],
        "5": [
          {
            "id": "1",
            "title": "exploring 3D",
            "description": "<span>Why:</span> I wanted to improve my skills in 3D modeling because it is something often used in web design, which is related to my goal of becoming a front-end developer. This opportunity allowed me to explore 3D design and apply it to my workflow. <br></br> <span>What:</span> I took this opportunity to learn and improve my skills in sculpting 3D objects in Blender, specifically for web design applications. By creating a party animal-style character, I gained hands-on experience with sculpting tools, UV mapping, and creating realistic textures. I also explored how 3D models can be used in web design, understanding their role in creating interactive or visual elements for websites. <br></br> <span>How:</span> By practicing and refining my 3D modeling skills, I developed a deeper understanding of how 3D objects can enhance web design. This experience was valuable for my development as a front-end developer, as it allowed me to expand my technical skills in areas that are increasingly used in modern web development. ",
            "images": [
              "./assets/images/projects/challenges/blender.png"
            ]
          },
          {
            "id": "5",
            "title": "exploring frameworks",
            "description": "<span>Why:</span> I wanted to learn about modern web development trends, especially frameworks like React, because they are used a lot in the industry. Frameworks are important for creating big and easy-to-maintain websites. My teacher suggested I start learning frameworks as feedback, so I decided to focus on React to understand how it works and how it fits in web development today. <br></br> <span>What:</span> I used Vite to set up a React project and worked on basic components like buttons, carousels, and text. I also learned to use React Router to navigate between pages. My teacher’s feedback helped me focus on learning the basics of React first, which is important before moving on to more advanced features. <br></br> <span>How:</span> This project helped me see how React can be used to build interactive websites. My teacher’s feedback made me realize that learning the basics is essential for improving my skills. Now I feel more confident using React and frameworks in my projects. In the future, I want to learn more about React and other frameworks to build more complex websites.",
            "images": [
              "./assets/images/projects/challenges/react_feedback.png"
            ]
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "pokemon api",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/sanderdehaar/pokemon_game_template"
          },
          {
            "text": "3d object",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/sanderdehaar/the_lost_archive"
          }
        ]
      }
    }
  ]
}