{
  "projects": [
    {
      "name": "brand studio",
      "title": "brand studio",
      "banner": {
        "backgroundImage": "./assets/images/projects/brand_studio/building.jpg",
        "bannerImage": "./assets/images/projects/brand_studio/banner_image.png",
        "heading": "uxynergy",
        "color": "#1E96FC"
      },
      "information": {
        "title": "project Information",
        "description": "Read about our brand studio project were we created our own brand that stands out of others and shows who we are.",
        "mockupImage": "./assets/images/projects/brand_studio/banner_second.png",
        "fullDescription": "Our team project is about creating a studio brand for our company, UXY (UXYnergy). We worked hard to develop a brand identity that truly represents who we are. We focused on the brand’s voice, logo, and visual style to create something unique and memorable. Our main goal was to build a brand that feels fun, stands out from the crowd, and shows the strong spirit of our team. In this project, we’ll take you through every step of the process. You’ll see everything from the initial sketches and wireframes to the stylescapes, version control, and detailed planning that went into the project."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "sketches",
            "description": "<span>Why:</span> I wanted to make sure our brand identity was clear so that our logo and visuals truly represent who we are and connect with our audience. <br></br> <span>What:</span> I started by organizing team discussions to decide on our brand’s voice and personality. We voted on our brand’s key characteristics, like our values and mission. I put everything we agreed on into a <a href='./assets/images/projects/brand_studio/documents/branding_document.pdf' target='_blank'>brand document<i class='fa-solid fa-arrow-right'></i></a>, so we could keep our ideas organized and make sure our design choices fit our brand’s message. <br></br> <span>How:</span> This document now guides our design for the logo, colors, and shapes, so each part matches our brand identity. Through this, I learned how to bring together everyone’s ideas into one clear plan. I also learned how to think about design from the audience’s point of view, making sure each visual choice communicates our brand clearly.",
            "images": [
              "./assets/images/projects/brand_studio/sketches_logo.png"
            ]
          },
          {
            "id": "2",
            "title": "stylescape",
            "description": "<span>Why:</span> I wanted to make a <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>stylescape<i class='fa-solid fa-arrow-right'></i></a> to get a strong visual feel for the brand. This would help keep our designs true to our brand’s personality and make sure they appeal to our audience. <br></br> <span>What:</span> I looked for images and design elements that showed our brand’s main values (fun, eye-catching, and dynamic). Finding the right visuals was hard, and it took time to pick images that really matched our brand. I focused on pictures that fit our brand’s core look and would help us keep a consistent design style. <br></br> <span>How:</span> In the end, the stylescape helped bring our brand vision to life. It made it easier to design visuals that match our brand identity. This process taught me how to turn brand ideas into real visuals, which will help in future design work. It also helped me improve my skills in creating a consistent look and feel for the brand, which is important in media design.",
            "images": [
              "./assets/images/projects/brand_studio/stylescape.png"
            ]
          }
        ],
        "2": [
          {
            "id": "1",
            "title": "github",
            "description": "<span>Why:</span> I wanted to improve team communication and workflow, so everyone could easily access and update our project files. <br></br> <span>What:</span> set up a <a href='https://github.com/Dracopol/uxy/tree/main' target='_blank'>GitHub<i class='fa-solid fa-arrow-right'></i></a> repository with a simple structure that everyone could follow. This made it easy to organize and share our work in one place. The setup process was simple and didn’t take much time. <br></br> <span>How:</span> In the end, the GitHub repository helped our team work together more smoothly. It kept our files organized and made it easy to track changes. This experience taught me that it can be really handy, since i had a merge conflict and I needed to go back to the old version.",
            "images": [
              "./assets/images/projects/brand_studio/uxy_github.png"
            ]
          }
        ],
        "3": [
          {
            "id": "1",
            "title": "business cards",
            "description": "<span>Why:</span> I wanted to create business cards that clearly show our brand’s identity using our brand’s color palette. <br></br> <span>What:</span> I designed three <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>business cards<i class='fa-solid fa-arrow-right'></i></a>, making sure to use our brand’s colors. After getting feedback from our teacher, I changed the logo to show unity and teamwork by making the puzzle pieces fit together. The teacher also suggested using bright colors, so I added them to make the design fun and eye-catching. I also looked for design ideas on Awwwards and Pinterest. <br></br> <span>How:</span> Designing these business cards helped me think creatively and mix both feedback and my own ideas. I had to find a way to make the logo represent unity and teamwork through the puzzle design. The bright colors made it hard to keep the design professional but still fun. The feedback helped me improve my work, and I learned how to apply feedback to improve my designs and make them more polished and professional, which is important for working in a real-world project.",
            "images": [
              "./assets/images/projects/brand_studio/bs1.png",
              "./assets/images/projects/brand_studio/bs2.png",
              "./assets/images/projects/brand_studio/bs3.png",
              "./assets/images/projects/brand_studio/bsfeedback.png",
              "./assets/images/projects/brand_studio/bs4.png"
            ]
          },
          {
            "id": "2",
            "title": "wireframes",
            "description": "<span>Why:</span> I wanted to create clear <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> for the website to plan how it would look and work, making sure it was easy to use and matched our brand. <br></br> <span>What:</span> I started by making a simple wireframe in Figma to plan the website layout. When I worked on the more detailed wireframe, I asked for feedback from the team. They said I should add more images, use more colors, and think about how to show the puzzle pieces in the design. I also made the header navigation easier to read and changed the colors to match the new branding. <br></br> <span>How:</span> The design process went well, but we had some problems with how to show the puzzle pieces and organize the website. We solved these problems together, and I learned how to improve my designs based on feedback. I also learned how to adjust my work when things change. Next time, I would spend more time improving the design and better manage my time. I then turned the wireframes into a real website, using what I learned.",
            "images": [
              "./assets/images/projects/brand_studio/wireframe.png",
              "./assets/images/projects/brand_studio/wireframe_feedback1.png",
              "./assets/images/projects/brand_studio/wireframe_feedback2.png",
              "./assets/images/projects/brand_studio/Homepages.png"
            ]
          },
          {
            "id": "3",
            "title": "website",
            "description": "<span>Why:</span> I wanted to turn the wireframe designs into a working website that looked like the design, was easy to use, and worked well on all devices. <br></br> <span>What:</span> I followed the <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>wireframes<i class='fa-solid fa-arrow-right'></i></a> carefully to build the <a href='https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1' target='_blank'>website<i class='fa-solid fa-arrow-right'></i></a>, making sure it looked like the design. I also made sure the website worked well on mobile devices, adjusting the layout for smaller screens. There were no big problems with talking to my colleague, and time management was not an issue. I also made sure the code was easy to read by organizing the files well, using the right names, and adding comments to explain things. <br></br> <span>How:</span> Building the website went well, and I was able to make it work as planned. I learned how important it is to keep the code clean and easy to understand. This helped me improve my coding skills and feel more confident in making websites that work well, look good, and are easy to maintain.",
            "images": [
              "./assets/images/projects/brand_studio/website.png",
              "./assets/images/projects/brand_studio/code.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "process",
            "description": "<span>Why:</span> At the start of the project, we needed to stay organized and keep everyone updated. I set up <a href='https://trello.com/b/Mk6JKvMD/to-do' target='_blank'>trello<i class='fa-solid fa-arrow-right'></i></a> with our group to track our goals, so we could easily share our progress with the stakeholders. <br></br> <span>What:</span> During the project, one of my teammates needed help with using GitHub and branches. I taught him how to use it, so he could work better. I also made sure to update the team on my progress, so they knew where we were in the project. <br></br> <span>How:</span> I used Trello to track and share our progress with the team and stakeholders. I helped my teammate with GitHub, making sure he understood how to use it. I also focused on making the website accessible for both mobile and desktop users, so it met the current web standards and trends. This helped the team stay on track and ensured we were working professionally.",
            "images": [
              "./assets/images/projects/brand_studio/trello.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "personal leadership",
            "description": "<span>Why:</span> At the beginning of the project, we talked about what we are good at and where we need to improve. I knew I could help with development because I have some experience. I also realized that planning is a weakness for me, so I wanted to work on that while helping the team. <br></br> <span>What:</span> I decided to help with development since I felt confident. To improve my planning skills, I helped set up Trello and made sure everything was moving along. Giving feedback to the team helped me understand how I can improve my communication and decision-making. <br></br> <span>How:</span> I used my skills in development to help the team. I worked on my planning by setting up Trello and keeping everything organized. I also learned that better communication would help the team make decisions faster. Next time, I want to focus on talking directly with the team so we can work more efficiently and make better decisions. This project helped me see my strengths and weaknesses, which will help me grow as a frontend developer.",
            "images": []
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "website",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          },
          {
            "text": "github",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/Dracopol/uxy/tree/main"
          },
          {
            "text": "trello",
            "icon": "fa-brands fa-trello",
            "link": "https://trello.com/b/Mk6JKvMD/to-do"
          },
          {
            "text": "brandguide",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/brand_studio/documents/branding_document.pdf"
          },
          {
            "text": "brandguide",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          }
        ]
      }
    },
    {
      "name": "portfolio",
      "title": "portfolio",
      "banner": {
        "backgroundImage": "./assets/images/projects/portfolio/nature.avif",
        "bannerImage": "./assets/images/projects/portfolio/mockup.png",
        "heading": "portfolio",
        "color": "#282828"
      },
      "information": {
        "title": "project Information",
        "description": "Read about my portfolio project were I created a website to display my work and my passion.",
        "mockupImage": "./assets/images/projects/portfolio/banner.png",
        "fullDescription": "In my portfolio, I show the process I went through for each project and why I made certain choices. I wanted every decision to be clear and have a purpose, helping the viewer understand my skills and style. I kept the layout simple so that each project is easy to explore. I chose colors, fonts, and design elements that match each project’s theme to make them stand out. I also listened to feedback, which helped me see areas for improvement and made my portfolio look more professional and engaging."
      },
      "outcomes": {
        "1": [
          {
            "id": "1",
            "title": "moodboard",
            "description": "<span>Why:</span> I made a moodboard because I wanted to explore different design ideas and find out what really speaks to me. I needed a way to see a variety of styles and ideas all in one place, so I could pick the elements that match my vision. Creating this moodboard helped give me direction and made me think more about what makes a design interesting and effective. <br></br> <span>What:</span> For my inspiration, I used the website awwwards.com. This site has some of the best website designs, so it was perfect for finding quality examples. I looked for sites with unique styles, strong visuals, and clear layouts. Then, I collected a mix of design styles, colors, layouts, and interactions to see what stood out to me. <br></br> <span>How:</span> Putting these inspirations together in a moodboard helped me clearly see which design principles I like most. It gave me a chance to look at different visual styles and decide what might work for my project. By making this moodboard it helps me with the basics of designing, for example understanding in a design why a element is placed on that particular position with that styling.",
            "images": [
              "./assets/images/projects/portfolio/moodboard.png"
            ]
          },
          {
            "id": "2",
            "title": "testing flow/design",
            "description": "<span>Why:</span> I did flow and design testing <a href='./assets/images/projects/portfolio/documents/testing_document.pdf' target='_blank'>document<i class='fa-solid fa-arrow-right'></i></a> on my portfolio wireframe with 5 people to make sure users could easily find my projects and contact me. I wanted to understand how they felt about the design and structure. <br></br> <span>What:</span> I gave them 5 tasks to complete, and based on their feedback, I learned that the menu icon wasn’t clear to users and they wanted a quicker way to navigate to the projects. <br></br> <span>How:</span> The testing went well good, since everyone finished their tasks quickly. I got useful feedback that I can improve on, and I’ll definitely do this again in the future because it helped me make the design better.",
            "images": [
              "./assets/images/projects/portfolio/testing.png"
            ]
          },
          {
            "id": "3",
            "title": "interactive prototyping",
            "description": "<span>Why:</span> I created an interactive prototype using Figma to see how the final product would look and work. I wanted to test how users would move through the design and make sure it worked well. This helped me see the design more clearly before building it and focused on making a good experience for users. <br></br> <span>What:</span> While working on the prototype, I learned how to use Figma’s prototyping tools, like making navigation flows and adding animations. I practiced how users would interact with the design, making it feel more real and dynamic. <br></br> <span>How:</span> The prototype helped me see the design in action, and using Figma’s tools showed me how important user flow and interaction are. I now feel more confident in making interactive prototypes. I’ve learned the basics, and this will help me in future projects. Next time, I can explore more advanced features in Figma to make my prototypes even better and more realistic.",
            "images": [
              "./assets/images/projects/portfolio/interactive.png"
            ]
          }
        ],
        "2": [],
        "3": [
          {
            "id": "1",
            "title": "wireframes home",
            "description": "<span>Why:</span> I created mid-fidelity wireframes to explore the design layout and functionality based on the moodboard I made. This helped me see how the design would look and work before adding more details. <br></br> <span>What:</span> I used the moodboard to guide my wireframe design. The wireframes helped me focus on the structure and layout without getting distracted by colors or images. <br></br> <span>How:</span> The wireframes helped me plan the layout and test the design’s flow. This step made it easier to improve the design before adding more details later.",
            "images": [
              "./assets/images/projects/portfolio/wireframes.png"
            ]
          },
          {
            "id": "2",
            "title": "wireframes low",
            "description": "<span>Why:</span> I chose the design wireframe I liked and built the full page based on the flow/design <a href='./assets/images/projects/portfolio/documents/testing_document.pdf' target='_blank'>testing<i class='fa-solid fa-arrow-right'></i></a> I did earlier. I wanted to turn my idea into a real layout and see how it would work in practice. <br></br> <span>What:</span> I worked through the first stage of the homepage, making changes based on the insights from the testing. This helped me see how the design could be improved. <br></br> <span>How:</span> By using the insights to improve the design, I felt more confident about how the homepage was coming together and had clear ideas for future changes.",
            "images": [
              "./assets/images/projects/portfolio/wireframe_full1.png",
              "./assets/images/projects/portfolio/wireframe_full2.png"
            ]
          },
          {
            "id": "3",
            "title": "wireframes high",
            "description": "<span>Why:</span> I turned the wireframes into high-fidelity versions to focus on details and improve the design. <br></br> <span>What:</span> I added more details to the wireframes, making them look more like the final design. <br></br> <span>How:</span> This process helped me realize how important user feedback is early on, as it helped me make better design choices.",
            "images": [
              "./assets/images/projects/portfolio/wireframe_high1.png",
              "./assets/images/projects/portfolio/wireframe_high2.png",
              "./assets/images/projects/portfolio/wireframe_high3.png"
            ]
          },
          {
            "id": "4",
            "title": "wireframes updated",
            "description": "<span>Why:</span> I chose the design wireframe I liked and built the full page to see how it would work in real life. I wanted to turn my idea into something more practical and see how everything would fit together. <br></br> <span>What:</span> I worked on the homepage, making changes based on my teacher's feedback. My teacher suggested making the 'Let's connect' section more eye-catching, using different buttons on the project page, and adding icons for the links. <br></br> <span>How:</span> The changes helped improve the design. By testing the design and using feedback, I could see where things needed to be better. These steps made me feel more confident in my choices, and now I have clear ideas for further improvements.",
            "images": [
              "./assets/images/projects/portfolio/design_feedback1.png",
              "./assets/images/projects/portfolio/updated1.png",
              "./assets/images/projects/portfolio/updated2.png",
              "./assets/images/projects/portfolio/updated3.png"
            ]
          },
          {
            "id": "5",
            "title": "development",
            "description": "<span>Why:</span> I started developing by setting up a GitHub and organizing my workspace with the right folder structure. I followed my Figma design and used ChatGPT to help speed up my coding process. I also added an animation library and FontAwesome for better user experience and easier embedding. I wanted to make sure the project was well-structured and efficient. <br></br> <span>What:</span> My teacher gave feedback that my coding structure was good, but suggested I learn more about frameworks, like modules and their structure. I didn’t face many problems, but I asked for feedback on how I could improve my coding skills and avoid bad habits. <br></br> <span>How:</span> This feedback made me realize I could improve by looking deeper into frameworks in the future. Although the process wasn’t too hard because of my experience, I’m eager to expand my skills and knowledge to create even better projects.",
            "images": [
              "./assets/images/projects/portfolio/development1.png",
              "./assets/images/projects/portfolio/development2.png",
              "./assets/images/projects/portfolio/development3.png"
            ]
          },
          {
            "id": "6",
            "title": "the website",
            "description": "<span>Why:</span> After getting feedback from my teacher, I realized the project page needed some improvements to make it clearer and easier to use. <br></br> <span>What:</span> My teacher suggested making the tabs more obvious so that users know they can click on them. For the learning outcomes section, I was advised to create different sections for each topic to make the page more organized. <br></br> <span>How:</span> These changes would help make the page more user-friendly and easier to navigate. By making the tabs clearer and organizing the learning outcomes, the design will be easier to understand and more effective. This feedback will help me keep improving the design in the next steps.",
            "images": [
              "./assets/images/projects/portfolio/website_feedback3.png",
              "./assets/images/projects/portfolio/website_feedback1.png",
              "./assets/images/projects/portfolio/website_feedback2.png",
              "./assets/images/projects/portfolio/website_feedback4.png"
            ]
          },
          {
            "id": "7",
            "title": "portfolio structure",
            "description": "<span>Why:</span> My teacher gave feedback to make the 'why, what, & how' method easier to see and understand. The 'Learning Outcomes' heading on desktop didn’t fit well, and the links in the learning outcomes needed to be clearer. Also, I should add more text to the project introduction for better context. <br></br> <span>What:</span> The feedback was to make the 'why, what, & how' method more visible. On desktop, I should remove the 'Learning Outcomes' heading and add an icon to the links to make them stand out. I also need to show more text in the introduction to give more details. <br></br> <span>How:</span> These changes will make the page easier to read and understand. Adding icons and more text will help make the design clearer and more helpful for users. This feedback really helped my design.",
            "images": [
              "./assets/images/projects/portfolio/website_feedback5.png",
              "./assets/images/projects/portfolio/structure1.png",
              "./assets/images/projects/portfolio/structure2.png"
            ]
          }
        ],
        "4": [
          {
            "id": "1",
            "title": "Process",
            "description": "At the start of the project, I helped set up <a href='https://trello.com/b/Mk6JKvMD/to-do' target='_blank'>trello<i class='fa-solid fa-arrow-right'></i></a> to track our goals. This way, we can keep stakeholders updated on our progress. <br></br> During the development phase, I noticed that one colleague needed help with branches and GitHub. I gave him a short lesson and assisted him throughout the process. <br></br> For communication, I regularly shared my progress with my team to keep them updated on how far I was in the project phase. <br></br> The accessibility is also a crucial part, to have our users be able to visit the website on mobile and desktop, since I’m trying to achieve the standard for websites and to keep up with website trend.",
            "images": [
              "./assets/images/projects/brand_studio/trello.png"
            ]
          }
        ],
        "5": [
          {
            "id": "1",
            "title": "Personal leadership",
            "description": "At the beginning of the project, we discussed our strengths and weaknesses. I saw an opportunity to help the team with development since I have some background in it. So, I volunteered to assist during the development phase of the project. I recognized that planning is one of my weaknesses, so I helped set up Trello and made sure everything was on track. The planning and giving people feedback will definitely be there when I’m working as a frontend developer in a company, so these insights could really help me seeing my own qualities. The project went well, but next time, I want to focus on having more direct communication within the team. This will help us make decisions faster and improve our time management.",
            "images": []
          }
        ]
      },
      "extraInformation": {
        "socials": [
          {
            "text": "website",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          },
          {
            "text": "github",
            "icon": "fa-brands fa-github",
            "link": "https://github.com/Dracopol/uxy/tree/main"
          },
          {
            "text": "trello",
            "icon": "fa-brands fa-trello",
            "link": "https://trello.com/b/Mk6JKvMD/to-do"
          },
          {
            "text": "brandguide",
            "icon": "fa-solid fa-file",
            "link": "./assets/images/projects/brand_studio/documents/branding_document.pdf"
          },
          {
            "text": "brandguide",
            "icon": "fa-brands fa-figma",
            "link": "https://www.figma.com/design/mqormZsN6gVOSTxJgNX6TZ/uxynergy?node-id=14-2287&t=t3tIIHwFGQ6Atz9O-1"
          }
        ]
      }
    }
  ]
}